[Killed] BlockStatement
filterData.js:1:56
-function filterData(pets, searchQuery, selectedFilter) {
-  return pets.filter(pet =>
-    (selectedFilter === "" || pet.type.includes(selectedFilter)) &&
-    (searchQuery === "" || pet.name.includes(searchQuery))
-  );
-}
+function filterData(pets, searchQuery, selectedFilter) {}
 module.exports = { filterData };
killedBy: filterData returns all pets when no filters are applied
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] MethodExpression
filterData.js:2:10
 function filterData(pets, searchQuery, selectedFilter) {
-  return pets.filter(pet =>
-    (selectedFilter === "" || pet.type.includes(selectedFilter)) &&
-    (searchQuery === "" || pet.name.includes(searchQuery))
-  );
+  return pets;
 }
 module.exports = { filterData };
killedBy: filterData filters pets by type
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 11

@@ -13,6 +13,17 @@
      "location": Any<Object>,
      "name": "Jose",

[Killed] ArrowFunction
filterData.js:2:22
 function filterData(pets, searchQuery, selectedFilter) {
-  return pets.filter(pet =>
-    (selectedFilter === "" || pet.type.includes(selectedFilter)) &&
-    (searchQuery === "" || pet.name.includes(searchQuery))
+  return pets.filter(() => undefined
   );
 }
killedBy: filterData returns all pets when no filters are applied
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 35
+ Received  +  1

- Array [
-   Object {
-     "description": "He's a big dog",

[Killed] EqualityOperator
filterData.js:3:6
 function filterData(pets, searchQuery, selectedFilter) {
   return pets.filter(pet =>
-    (selectedFilter === "" || pet.type.includes(selectedFilter)) &&
+    (selectedFilter !== "" || pet.type.includes(selectedFilter)) &&
     (searchQuery === "" || pet.name.includes(searchQuery))
   );
killedBy: filterData filters pets by type
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 11

@@ -13,6 +13,17 @@
      "location": Any<Object>,
      "name": "Jose",

[Killed] LogicalOperator
filterData.js:3:6
 function filterData(pets, searchQuery, selectedFilter) {
   return pets.filter(pet =>
-    (selectedFilter === "" || pet.type.includes(selectedFilter)) &&
+    (selectedFilter === "" && pet.type.includes(selectedFilter)) &&
     (searchQuery === "" || pet.name.includes(searchQuery))
   );
killedBy: filterData filters pets by type
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 18
+ Received  +  1

- Array [
-   Object {
-     "description": "He's a big dog",

[Killed] ConditionalExpression
filterData.js:4:6
 function filterData(pets, searchQuery, selectedFilter) {
   return pets.filter(pet =>
     (selectedFilter === "" || pet.type.includes(selectedFilter)) &&
-    (searchQuery === "" || pet.name.includes(searchQuery))
+    (true)
   );
 }
killedBy: filterData filters pets by search query (name)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 23

  Array [
    Object {
+     "description": "He's a big dog",

[Killed] EqualityOperator
filterData.js:4:6
 function filterData(pets, searchQuery, selectedFilter) {
   return pets.filter(pet =>
     (selectedFilter === "" || pet.type.includes(selectedFilter)) &&
-    (searchQuery === "" || pet.name.includes(searchQuery))
+    (searchQuery !== "" || pet.name.includes(searchQuery))
   );
 }
killedBy: filterData filters pets by search query (name)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 23

  Array [
    Object {
+     "description": "He's a big dog",
