[NoCoverage] StringLiteral
app/(tabs)/LoginScreen.tsx:7:38
 import { supabase } from "../../lib/supabase";
 
 export default function LoginScreen() {
-  const [email, setEmail] = useState("");
+  const [email, setEmail] = useState("Stryker was here!");
   const [password, setPassword] = useState("");
   const [otp, setOtp] = useState("");

[NoCoverage] StringLiteral
app/(tabs)/LoginScreen.tsx:8:44
 
 export default function LoginScreen() {
   const [email, setEmail] = useState("");
-  const [password, setPassword] = useState("");
+  const [password, setPassword] = useState("Stryker was here!");
   const [otp, setOtp] = useState("");
   const [loading, setLoading] = useState(false);

[NoCoverage] BooleanLiteral
app/(tabs)/LoginScreen.tsx:10:42
   const [email, setEmail] = useState("");
   const [password, setPassword] = useState("");
   const [otp, setOtp] = useState("");
-  const [loading, setLoading] = useState(false);
+  const [loading, setLoading] = useState(true);
   const [requiresOtp, setRequiresOtp] = useState(false);
   const [user, setUser] = useState<any>(null);

[NoCoverage] BooleanLiteral
app/(tabs)/LoginScreen.tsx:11:50
   const [password, setPassword] = useState("");
   const [otp, setOtp] = useState("");
   const [loading, setLoading] = useState(false);
-  const [requiresOtp, setRequiresOtp] = useState(false);
+  const [requiresOtp, setRequiresOtp] = useState(true);
   const [user, setUser] = useState<any>(null);
     const [errorMessage, setErrorMessage] = useState(""); // 🔴 New State for Error Messages

[NoCoverage] StringLiteral
app/(tabs)/LoginScreen.tsx:13:54
   const [loading, setLoading] = useState(false);
   const [requiresOtp, setRequiresOtp] = useState(false);
   const [user, setUser] = useState<any>(null);
-    const [errorMessage, setErrorMessage] = useState(""); // 🔴 New State for Error Messages
+    const [errorMessage, setErrorMessage] = useState("Stryker was here!"); // 🔴 New State for Error Messages
   const router = useRouter();
 

[NoCoverage] BooleanLiteral
app/(tabs)/LoginScreen.tsx:17:16
   const router = useRouter();
 
   const handleLogin = async () => {
-    setLoading(true);
+    setLoading(false);
 
     const { data, error } = await supabase.auth.signInWithPassword({ email, password });

[NoCoverage] ObjectLiteral
app/(tabs)/LoginScreen.tsx:19:68
   const handleLogin = async () => {
     setLoading(true);
 
-    const { data, error } = await supabase.auth.signInWithPassword({ email, password });
+    const { data, error } = await supabase.auth.signInWithPassword({});
 
     if (error) {

[NoCoverage] BlockStatement
app/(tabs)/LoginScreen.tsx:21:16
 
     const { data, error } = await supabase.auth.signInWithPassword({ email, password });
 
-    if (error) {
-      Alert.alert("Login Failed", error.message);
-      setLoading(false);
-      return;
-    }
+    if (error) {}
 
     const { data: userData } = await supabase

[NoCoverage] BooleanLiteral
app/(tabs)/LoginScreen.tsx:23:18
 
     if (error) {
       Alert.alert("Login Failed", error.message);
-      setLoading(false);
+      setLoading(true);
       return;
     }

[NoCoverage] StringLiteral
app/(tabs)/LoginScreen.tsx:30:11
     const { data: userData } = await supabase
       .from("users")
       .select("id, two_factor_enabled, two_factor_method")
-      .eq("id", data.user.id)
+      .eq("", data.user.id)
       .single();
 

[NoCoverage] ConditionalExpression
app/(tabs)/LoginScreen.tsx:33:9
       .eq("id", data.user.id)
       .single();
 
-    if (userData?.two_factor_enabled) {
+    if (true) {
       setRequiresOtp(true);
       setUser(userData);

[NoCoverage] ConditionalExpression
app/(tabs)/LoginScreen.tsx:33:9
       .eq("id", data.user.id)
       .single();
 
-    if (userData?.two_factor_enabled) {
+    if (false) {
       setRequiresOtp(true);
       setUser(userData);

[NoCoverage] BooleanLiteral
app/(tabs)/LoginScreen.tsx:34:22
       .single();
 
     if (userData?.two_factor_enabled) {
-      setRequiresOtp(true);
+      setRequiresOtp(false);
       setUser(userData);
     } else {

[NoCoverage] BlockStatement
app/(tabs)/LoginScreen.tsx:36:12
     if (userData?.two_factor_enabled) {
       setRequiresOtp(true);
       setUser(userData);
-    } else {
-      router.replace("/(tabs)/");
-    }
+    } else {}
 
     setLoading(false);

[NoCoverage] StringLiteral
app/(tabs)/LoginScreen.tsx:37:22
       setRequiresOtp(true);
       setUser(userData);
     } else {
-      router.replace("/(tabs)/");
+      router.replace("");
     }
 

[NoCoverage] BlockStatement
app/(tabs)/LoginScreen.tsx:43:33
     setLoading(false);
   };
 
-  const verifyOtp = async () => {
-    setLoading(true);
-    const { data, error } = await supabase.rpc("validate_otp", {
-      user_id: user.id,
-      otp,
-    });
-
-    if (error) {
-      Alert.alert("Invalid OTP", error.message);
-      setLoading(false);
-      return;
-    }
-
-    router.replace("/(tabs)/");
-    setLoading(false);
-  };
+  const verifyOtp = async () => {};
 
   return (

[NoCoverage] BooleanLiteral
app/(tabs)/LoginScreen.tsx:44:16
   };
 
   const verifyOtp = async () => {
-    setLoading(true);
+    setLoading(false);
     const { data, error } = await supabase.rpc("validate_otp", {
       user_id: user.id,

[NoCoverage] ObjectLiteral
app/(tabs)/LoginScreen.tsx:45:64
 
   const verifyOtp = async () => {
     setLoading(true);
-    const { data, error } = await supabase.rpc("validate_otp", {
-      user_id: user.id,
-      otp,
-    });
+    const { data, error } = await supabase.rpc("validate_otp", {});
 
     if (error) {

[NoCoverage] StringLiteral
app/(tabs)/LoginScreen.tsx:45:48
 
   const verifyOtp = async () => {
     setLoading(true);
-    const { data, error } = await supabase.rpc("validate_otp", {
+    const { data, error } = await supabase.rpc("", {
       user_id: user.id,
       otp,

[NoCoverage] BlockStatement
app/(tabs)/LoginScreen.tsx:50:16
       otp,
     });
 
-    if (error) {
-      Alert.alert("Invalid OTP", error.message);
-      setLoading(false);
-      return;
-    }
+    if (error) {}
 
     router.replace("/(tabs)/");

[NoCoverage] BooleanLiteral
app/(tabs)/LoginScreen.tsx:52:18
 
     if (error) {
       Alert.alert("Invalid OTP", error.message);
-      setLoading(false);
+      setLoading(true);
       return;
     }

[NoCoverage] BooleanLiteral
app/(tabs)/LoginScreen.tsx:57:16
     }
 
     router.replace("/(tabs)/");
-    setLoading(false);
+    setLoading(true);
   };
 

[NoCoverage] ObjectLiteral
app/(tabs)/LoginScreen.tsx:61:18
   };
 
   return (
-    <View style={{ flex: 1, justifyContent: "center", alignItems: "center", padding: 20 }}>
+    <View style={{}}>
       <Text style={{ fontSize: 24, fontWeight: "bold", marginBottom: 20 }}>Login</Text>
 

[NoCoverage] ObjectLiteral
app/(tabs)/LoginScreen.tsx:62:20
 
   return (
     <View style={{ flex: 1, justifyContent: "center", alignItems: "center", padding: 20 }}>
-      <Text style={{ fontSize: 24, fontWeight: "bold", marginBottom: 20 }}>Login</Text>
+      <Text style={{}}>Login</Text>
 
       <TextInput

[NoCoverage] ArrowFunction
app/(tabs)/LoginScreen.tsx:94:18
       />
 
       <TouchableOpacity
-        onPress={() => router.push("/(tabs)/reset")}
+        onPress={() => undefined}
         style={{ alignSelf: "flex-end", marginBottom: 15 }}
       >

[NoCoverage] StringLiteral
app/(tabs)/LoginScreen.tsx:97:31
         onPress={() => router.push("/(tabs)/reset")}
         style={{ alignSelf: "flex-end", marginBottom: 15 }}
       >
-        <Text style={{ color: "#3498db", textDecorationLine: "underline" }}>Forgot Password?</Text>
+        <Text style={{ color: "", textDecorationLine: "underline" }}>Forgot Password?</Text>
       </TouchableOpacity>
 

[NoCoverage] ObjectLiteral
app/(tabs)/LoginScreen.tsx:97:22
         onPress={() => router.push("/(tabs)/reset")}
         style={{ alignSelf: "flex-end", marginBottom: 15 }}
       >
-        <Text style={{ color: "#3498db", textDecorationLine: "underline" }}>Forgot Password?</Text>
+        <Text style={{}}>Forgot Password?</Text>
       </TouchableOpacity>
 

[NoCoverage] BooleanLiteral
app/(tabs)/LoginScreen.tsx:100:8
         <Text style={{ color: "#3498db", textDecorationLine: "underline" }}>Forgot Password?</Text>
       </TouchableOpacity>
 
-      {!requiresOtp ? (
+      {requiresOtp ? (
         <TouchableOpacity
           onPress={handleLogin}

[NoCoverage] StringLiteral
app/(tabs)/LoginScreen.tsx:104:30
         <TouchableOpacity
           onPress={handleLogin}
           style={{
-            backgroundColor: "#3498db",
+            backgroundColor: "",
             padding: 12,
             borderRadius: 5,

[NoCoverage] StringLiteral
app/(tabs)/LoginScreen.tsx:108:25
             padding: 12,
             borderRadius: 5,
             width: "100%",
-            alignItems: "center",
+            alignItems: "",
           }}
         >

[NoCoverage] StringLiteral
app/(tabs)/LoginScreen.tsx:114:35
           {loading ? (
             <ActivityIndicator color="#fff" />
           ) : (
-            <Text style={{ color: "#fff", fontWeight: "bold" }}>Login</Text>
+            <Text style={{ color: "", fontWeight: "bold" }}>Login</Text>
           )}
         </TouchableOpacity>

[NoCoverage] StringLiteral
app/(tabs)/LoginScreen.tsx:136:32
           <TouchableOpacity
             onPress={verifyOtp}
             style={{
-              backgroundColor: "green",
+              backgroundColor: "",
               padding: 12,
               borderRadius: 5,

[NoCoverage] StringLiteral
app/(tabs)/LoginScreen.tsx:146:57
             {loading ? (
               <ActivityIndicator color="#fff" />
             ) : (
-              <Text style={{ color: "#fff", fontWeight: "bold" }}>Verify OTP</Text>
+              <Text style={{ color: "#fff", fontWeight: "" }}>Verify OTP</Text>
             )}
           </TouchableOpacity>

[NoCoverage] ObjectLiteral
app/(tabs)/LoginScreen.tsx:156:16
 }
 
 const styles = StyleSheet.create({
-    container: {
-        flex: 1,
-        justifyContent: "center",
-        padding: 20,
-        backgroundColor: "#ffffff",
-    },
+    container: {},
     appTitle: {
         fontSize: 32,

[NoCoverage] StringLiteral
app/(tabs)/LoginScreen.tsx:158:25
 const styles = StyleSheet.create({
     container: {
         flex: 1,
-        justifyContent: "center",
+        justifyContent: "",
         padding: 20,
         backgroundColor: "#ffffff",

[NoCoverage] StringLiteral
app/(tabs)/LoginScreen.tsx:166:20
         fontSize: 32,
         fontWeight: "bold",
         color: "#81C090",
-        textAlign: "center",
+        textAlign: "",
         marginBottom: 10,
     },

[NoCoverage] ObjectLiteral
app/(tabs)/LoginScreen.tsx:169:12
         textAlign: "center",
         marginBottom: 10,
     },
-    title: {
-        fontSize: 24,
-        fontWeight: "bold",
-        color: "#333333",
-        marginBottom: 10,
-        textAlign: "center",
-    },
+    title: {},
     subtitle: {
         fontSize: 16,

[NoCoverage] StringLiteral
app/(tabs)/LoginScreen.tsx:172:16
     title: {
         fontSize: 24,
         fontWeight: "bold",
-        color: "#333333",
+        color: "",
         marginBottom: 10,
         textAlign: "center",

[NoCoverage] ObjectLiteral
app/(tabs)/LoginScreen.tsx:176:15
         marginBottom: 10,
         textAlign: "center",
     },
-    subtitle: {
-        fontSize: 16,
-        color: "#666666",
-        marginBottom: 20,
-        textAlign: "center",
-    },
+    subtitle: {},
     input: {
         width: "100%",

[NoCoverage] StringLiteral
app/(tabs)/LoginScreen.tsx:178:16
     },
     subtitle: {
         fontSize: 16,
-        color: "#666666",
+        color: "",
         marginBottom: 20,
         textAlign: "center",

[NoCoverage] StringLiteral
app/(tabs)/LoginScreen.tsx:185:22
     input: {
         width: "100%",
         height: 50,
-        borderColor: "#cccccc",
+        borderColor: "",
         borderWidth: 1,
         borderRadius: 8,

[NoCoverage] StringLiteral
app/(tabs)/LoginScreen.tsx:191:16
         paddingHorizontal: 10,
         marginBottom: 15,
         fontSize: 16,
-        color: "#333333",
+        color: "",
     },
     loginButton: {

[NoCoverage] StringLiteral
app/(tabs)/LoginScreen.tsx:202:16
         marginBottom: 20,
     },
     loginButtonText: {
-        color: "#ffffff",
+        color: "",
         fontSize: 16,
         fontWeight: "bold",

[NoCoverage] ObjectLiteral
app/(tabs)/LoginScreen.tsx:206:16
         fontSize: 16,
         fontWeight: "bold",
     },
-    errorText: {
-        color: "red", // 🔴 Makes Error Message Red
-        fontSize: 14,
-        textAlign: "center",
-        marginBottom: 10,
-    },
+    errorText: {},
 });
 

[NoCoverage] StringLiteral
app/(tabs)/LoginScreen.tsx:207:16
         fontWeight: "bold",
     },
     errorText: {
-        color: "red", // 🔴 Makes Error Message Red
+        color: "", // 🔴 Makes Error Message Red
         fontSize: 14,
         textAlign: "center",
