[NoCoverage] BooleanLiteral
app/(tabs)/Enable2FAScreen.tsx:10:44
 export default function Enable2FAScreen() {
     const [totpSecret, setTotpSecret] = useState<string | null>(null);
     const [user, setUser] = useState<any>(null);
-    const [loading, setLoading] = useState(true);
+    const [loading, setLoading] = useState(false);
 
     // 🔹 Fetch authenticated user when screen loads

[NoCoverage] BlockStatement
app/(tabs)/Enable2FAScreen.tsx:13:21
     const [loading, setLoading] = useState(true);
 
     // 🔹 Fetch authenticated user when screen loads
-    useEffect(() => {
-        const fetchUser = async () => {
-            const { data, error } = await supabase.auth.getUser();
-            if (error) {
-                Alert.alert("Error", "Failed to fetch user.");
-                setLoading(false);
-                return;
-            }
-            setUser(data.user);
-            setLoading(false);
-        };
-        fetchUser();
-    }, []);
+    useEffect(() => {}, []);
 
     // 🔹 Generate a secure TOTP secret and store it in Supabase

[NoCoverage] BlockStatement
app/(tabs)/Enable2FAScreen.tsx:14:39
 
     // 🔹 Fetch authenticated user when screen loads
     useEffect(() => {
-        const fetchUser = async () => {
-            const { data, error } = await supabase.auth.getUser();
-            if (error) {
-                Alert.alert("Error", "Failed to fetch user.");
-                setLoading(false);
-                return;
-            }
-            setUser(data.user);
-            setLoading(false);
-        };
+        const fetchUser = async () => {};
         fetchUser();
     }, []);

[NoCoverage] ConditionalExpression
app/(tabs)/Enable2FAScreen.tsx:16:17
     useEffect(() => {
         const fetchUser = async () => {
             const { data, error } = await supabase.auth.getUser();
-            if (error) {
+            if (false) {
                 Alert.alert("Error", "Failed to fetch user.");
                 setLoading(false);

[NoCoverage] ConditionalExpression
app/(tabs)/Enable2FAScreen.tsx:16:17
     useEffect(() => {
         const fetchUser = async () => {
             const { data, error } = await supabase.auth.getUser();
-            if (error) {
+            if (true) {
                 Alert.alert("Error", "Failed to fetch user.");
                 setLoading(false);

[NoCoverage] StringLiteral
app/(tabs)/Enable2FAScreen.tsx:17:29
         const fetchUser = async () => {
             const { data, error } = await supabase.auth.getUser();
             if (error) {
-                Alert.alert("Error", "Failed to fetch user.");
+                Alert.alert("", "Failed to fetch user.");
                 setLoading(false);
                 return;

[NoCoverage] StringLiteral
app/(tabs)/Enable2FAScreen.tsx:17:38
         const fetchUser = async () => {
             const { data, error } = await supabase.auth.getUser();
             if (error) {
-                Alert.alert("Error", "Failed to fetch user.");
+                Alert.alert("Error", "");
                 setLoading(false);
                 return;

[NoCoverage] BooleanLiteral
app/(tabs)/Enable2FAScreen.tsx:18:28
             const { data, error } = await supabase.auth.getUser();
             if (error) {
                 Alert.alert("Error", "Failed to fetch user.");
-                setLoading(false);
+                setLoading(true);
                 return;
             }

[NoCoverage] BooleanLiteral
app/(tabs)/Enable2FAScreen.tsx:22:24
                 return;
             }
             setUser(data.user);
-            setLoading(false);
+            setLoading(true);
         };
         fetchUser();

[NoCoverage] BlockStatement
app/(tabs)/Enable2FAScreen.tsx:28:44
     }, []);
 
     // 🔹 Generate a secure TOTP secret and store it in Supabase
-    const generateTOTPSecret = async () => {
-        if (!user) {
-            Alert.alert("Error", "User not found. Please log in.");
-            return;
-        }
-
-        // Generate a random base32 secret (compatible with Google Authenticator)
-        const secret = nanoid(32);
-        setTotpSecret(secret);
-
-        const { error } = await supabase
-            .from("users")
-            .update({ two_factor_enabled: true, two_factor_method: "totp", totp_secret: secret })
-            .eq("id", user.id);
-
-        if (error) {
-            Alert.alert("Error", error.message);
-        } else {
-            Alert.alert("Success", "2FA Enabled! Scan the QR code with Google Authenticator.");
-        }
-    };
+    const generateTOTPSecret = async () => {};
 
     // 🔹 Generate a QR Code for Google Authenticator

[NoCoverage] BlockStatement
app/(tabs)/Enable2FAScreen.tsx:29:20
 
     // 🔹 Generate a secure TOTP secret and store it in Supabase
     const generateTOTPSecret = async () => {
-        if (!user) {
-            Alert.alert("Error", "User not found. Please log in.");
-            return;
-        }
+        if (!user) {}
 
         // Generate a random base32 secret (compatible with Google Authenticator)

[NoCoverage] ConditionalExpression
app/(tabs)/Enable2FAScreen.tsx:29:13
 
     // 🔹 Generate a secure TOTP secret and store it in Supabase
     const generateTOTPSecret = async () => {
-        if (!user) {
+        if (true) {
             Alert.alert("Error", "User not found. Please log in.");
             return;

[NoCoverage] BooleanLiteral
app/(tabs)/Enable2FAScreen.tsx:40:43
 
         const { error } = await supabase
             .from("users")
-            .update({ two_factor_enabled: true, two_factor_method: "totp", totp_secret: secret })
+            .update({ two_factor_enabled: false, two_factor_method: "totp", totp_secret: secret })
             .eq("id", user.id);
 

[NoCoverage] BlockStatement
app/(tabs)/Enable2FAScreen.tsx:43:20
             .update({ two_factor_enabled: true, two_factor_method: "totp", totp_secret: secret })
             .eq("id", user.id);
 
-        if (error) {
-            Alert.alert("Error", error.message);
-        } else {
+        if (error) {} else {
             Alert.alert("Success", "2FA Enabled! Scan the QR code with Google Authenticator.");
         }

[NoCoverage] StringLiteral
app/(tabs)/Enable2FAScreen.tsx:44:25
             .eq("id", user.id);
 
         if (error) {
-            Alert.alert("Error", error.message);
+            Alert.alert("", error.message);
         } else {
             Alert.alert("Success", "2FA Enabled! Scan the QR code with Google Authenticator.");

[NoCoverage] BlockStatement
app/(tabs)/Enable2FAScreen.tsx:45:16
 
         if (error) {
             Alert.alert("Error", error.message);
-        } else {
-            Alert.alert("Success", "2FA Enabled! Scan the QR code with Google Authenticator.");
-        }
+        } else {}
     };
 

[NoCoverage] StringLiteral
app/(tabs)/Enable2FAScreen.tsx:46:36
         if (error) {
             Alert.alert("Error", error.message);
         } else {
-            Alert.alert("Success", "2FA Enabled! Scan the QR code with Google Authenticator.");
+            Alert.alert("Success", "");
         }
     };

[NoCoverage] BlockStatement
app/(tabs)/Enable2FAScreen.tsx:51:32
     };
 
     // 🔹 Generate a QR Code for Google Authenticator
-    const getQRCodeURI = () => {
-        if (!totpSecret || !user?.email) return "";
-        return `otpauth://totp/PetFinder:${user.email}?secret=${totpSecret}&issuer=PetFinder`;
-    };
+    const getQRCodeURI = () => {};
 
     if (loading) {

[NoCoverage] LogicalOperator
app/(tabs)/Enable2FAScreen.tsx:52:13
 
     // 🔹 Generate a QR Code for Google Authenticator
     const getQRCodeURI = () => {
-        if (!totpSecret || !user?.email) return "";
+        if (!totpSecret && !user?.email) return "";
         return `otpauth://totp/PetFinder:${user.email}?secret=${totpSecret}&issuer=PetFinder`;
     };

[NoCoverage] OptionalChaining
app/(tabs)/Enable2FAScreen.tsx:52:29
 
     // 🔹 Generate a QR Code for Google Authenticator
     const getQRCodeURI = () => {
-        if (!totpSecret || !user?.email) return "";
+        if (!totpSecret || !user.email) return "";
         return `otpauth://totp/PetFinder:${user.email}?secret=${totpSecret}&issuer=PetFinder`;
     };

[NoCoverage] StringLiteral
app/(tabs)/Enable2FAScreen.tsx:65:49
     }
 
     return (
-        <View style={{ flex: 1, justifyContent: "center", alignItems: "center", padding: 20 }}>
+        <View style={{ flex: 1, justifyContent: "", alignItems: "center", padding: 20 }}>
             <Text style={{ fontSize: 20, marginBottom: 20 }}>Enable Two-Factor Authentication</Text>
 

[NoCoverage] LogicalOperator
app/(tabs)/Enable2FAScreen.tsx:75:14
                 <Text style={{ color: "white" }}>Enable TOTP 2FA</Text>
             </TouchableOpacity>
 
-            {totpSecret && (
-                <>
-                    <Text style={{ marginTop: 20 }}>Scan this QR Code:</Text>
-                    <QRCode value={getQRCodeURI()} size={200} />
-                </>
-            )}
+            {totpSecret || <>
+                    <Text style={{
+    marginTop: 20
+  }}>Scan this QR Code:</Text>
+                    <QRCode value={getQRCodeURI()} size={200} />
+                </>}
         </View>
     );

[NoCoverage] ConditionalExpression
app/(tabs)/Enable2FAScreen.tsx:75:14
                 <Text style={{ color: "white" }}>Enable TOTP 2FA</Text>
             </TouchableOpacity>
 
-            {totpSecret && (
-                <>
-                    <Text style={{ marginTop: 20 }}>Scan this QR Code:</Text>
-                    <QRCode value={getQRCodeURI()} size={200} />
-                </>
-            )}
+            {true}
         </View>
     );

[NoCoverage] ObjectLiteral
app/(tabs)/Enable2FAScreen.tsx:77:34
 
             {totpSecret && (
                 <>
-                    <Text style={{ marginTop: 20 }}>Scan this QR Code:</Text>
+                    <Text style={{}}>Scan this QR Code:</Text>
                     <QRCode value={getQRCodeURI()} size={200} />
                 </>
