[NoCoverage] StringLiteral
app/(tabs)/explore.tsx:13:56
 export default function TabTwoScreen() {
   return (
     <ParallaxScrollView
-      headerBackgroundColor={{ light: '#D0D0D0', dark: '#353636' }}
+      headerBackgroundColor={{ light: '#D0D0D0', dark: "" }}
       headerImage={
         <IconSymbol

[NoCoverage] StringLiteral
app/(tabs)/explore.tsx:52:87
           <ThemedText type="defaultSemiBold">@3x</ThemedText> suffixes to provide files for
           different screen densities
         </ThemedText>
-        <Image source={require('@/assets/images/react-logo.png')} style={{ alignSelf: 'center' }} />
+        <Image source={require('@/assets/images/react-logo.png')} style={{ alignSelf: "" }} />
         <ExternalLink href="https://reactnative.dev/docs/images">
           <ThemedText type="link">Learn more</ThemedText>

[NoCoverage] StringLiteral
app/(tabs)/explore.tsx:60:44
       <Collapsible title="Custom fonts">
         <ThemedText>
           Open <ThemedText type="defaultSemiBold">app/_layout.tsx</ThemedText> to see how to load{' '}
-          <ThemedText style={{ fontFamily: 'SpaceMono' }}>
+          <ThemedText style={{ fontFamily: "" }}>
             custom fonts such as this one.
           </ThemedText>

[NoCoverage] StringLiteral
app/(tabs)/explore.tsx:70:62
       </Collapsible>
       <Collapsible title="Light and dark mode components">
         <ThemedText>
-          This template has light and dark mode support. The{' '}
+          This template has light and dark mode support. The{""}
           <ThemedText type="defaultSemiBold">useColorScheme()</ThemedText> hook lets you inspect
           what the user's current color scheme is, and so you can adjust UI colors accordingly.

[NoCoverage] UnaryOperator
app/(tabs)/explore.tsx:101:13
 const styles = StyleSheet.create({
   headerImage: {
     color: '#808080',
-    bottom: -90,
+    bottom: +90,
     left: -35,
     position: 'absolute',

[NoCoverage] UnaryOperator
app/(tabs)/explore.tsx:102:11
   headerImage: {
     color: '#808080',
     bottom: -90,
-    left: -35,
+    left: +35,
     position: 'absolute',
   },

[NoCoverage] StringLiteral
app/(tabs)/explore.tsx:103:15
     color: '#808080',
     bottom: -90,
     left: -35,
-    position: 'absolute',
+    position: "",
   },
   titleContainer: {
