[NoCoverage] BlockStatement
app/(tabs)/HomeScreen.tsx:9:38
 export default function HomeScreen() {
     const router = useRouter();
 
-    const handleLogout = async () => {
-        await supabase.auth.signOut();
-        await AsyncStorage.removeItem("userSession");
-        router.replace("/login"); // Redirect to login screen
-    };
+    const handleLogout = async () => {};
 
     return (

[NoCoverage] ObjectLiteral
app/(tabs)/HomeScreen.tsx:17:26
 
     return (
         <View style={{ flex: 1, justifyContent: "center", alignItems: "center" }}>
-            <Text style={{ fontSize: 24, fontWeight: "bold", marginBottom: 20 }}>Welcome to Pet Finder!</Text>
+            <Text style={{}}>Welcome to Pet Finder!</Text>
 
             <TouchableOpacity

[NoCoverage] StringLiteral
app/(tabs)/HomeScreen.tsx:22:38
             <TouchableOpacity
                 onPress={handleLogout}
                 style={{
-                    backgroundColor: "red",
+                    backgroundColor: "",
                     padding: 12,
                     borderRadius: 5,

[NoCoverage] StringLiteral
app/(tabs)/HomeScreen.tsx:25:28
                     backgroundColor: "red",
                     padding: 12,
                     borderRadius: 5,
-                    width: "80%",
+                    width: "",
                     alignItems: "center",
                 }}

[NoCoverage] StringLiteral
app/(tabs)/HomeScreen.tsx:29:59
                     alignItems: "center",
                 }}
             >
-                <Text style={{ color: "#fff", fontWeight: "bold" }}>Logout</Text>
+                <Text style={{ color: "#fff", fontWeight: "" }}>Logout</Text>
             </TouchableOpacity>
         </View>

[NoCoverage] ObjectLiteral
app/(tabs)/HomeScreen.tsx:29:30
                     alignItems: "center",
                 }}
             >
-                <Text style={{ color: "#fff", fontWeight: "bold" }}>Logout</Text>
+                <Text style={{}}>Logout</Text>
             </TouchableOpacity>
         </View>
