[NoCoverage] StringLiteral
app/(tabs)/index.tsx:11:56
 export default function HomeScreen() {
   return (
     <ParallaxScrollView
-      headerBackgroundColor={{ light: '#faf0dc', dark: '#faf0dc' }}
+      headerBackgroundColor={{ light: '#faf0dc', dark: "" }}
       headerImage={
         <Image

[NoCoverage] ObjectLiteral
app/(tabs)/index.tsx:29:30
           Edit <ThemedText type="defaultSemiBold">app/(tabs)/index.tsx</ThemedText> to see changes.
           Press{' '}
           <ThemedText type="defaultSemiBold">
-            {Platform.select({
-              ios: 'cmd + d',
-              android: 'cmd + m',
-              web: 'F12'
-            })}
+            {Platform.select({})}
           </ThemedText>{' '}
           to open developer tools.

[NoCoverage] StringLiteral
app/(tabs)/index.tsx:47:34
       <ThemedView style={styles.stepContainer}>
         <ThemedText type="subtitle">Step 3: Get a fresh start</ThemedText>
         <ThemedText>
-          When you're ready, run{' '}
+          When you're ready, run{""}
           <ThemedText type="defaultSemiBold">npm run reset-project</ThemedText> to get a fresh{' '}
           <ThemedText type="defaultSemiBold">app</ThemedText> directory. This will move the current{' '}

[NoCoverage] StringLiteral
app/(tabs)/index.tsx:48:96
         <ThemedText type="subtitle">Step 3: Get a fresh start</ThemedText>
         <ThemedText>
           When you're ready, run{' '}
-          <ThemedText type="defaultSemiBold">npm run reset-project</ThemedText> to get a fresh{' '}
+          <ThemedText type="defaultSemiBold">npm run reset-project</ThemedText> to get a fresh{""}
           <ThemedText type="defaultSemiBold">app</ThemedText> directory. This will move the current{' '}
           <ThemedText type="defaultSemiBold">app</ThemedText> to{' '}

[NoCoverage] StringLiteral
app/(tabs)/index.tsx:78:15
   reactLogo: {
     height: 200,
     width: '100%',       // Use full width or adjust as needed
-    position: 'absolute',
+    position: "",
     // Horizontal centering
     left: 0,

[NoCoverage] StringLiteral
app/(tabs)/index.tsx:84:10
     right: 0,
     marginHorizontal: 'auto',
     // Vertical centering
-    top: '50%',          // Position at 50% from top
+    top: "",          // Position at 50% from top
     marginTop: -100,     // Offset half the height (200/2 = 100)
     // Optional: Maintain aspect ratio

[NoCoverage] UnaryOperator
app/(tabs)/index.tsx:85:16
     marginHorizontal: 'auto',
     // Vertical centering
     top: '50%',          // Position at 50% from top
-    marginTop: -100,     // Offset half the height (200/2 = 100)
+    marginTop: +100,     // Offset half the height (200/2 = 100)
     // Optional: Maintain aspect ratio
     resizeMode: 'cover',

[NoCoverage] ArrayDeclaration
app/(tabs)/index.tsx:88:16
     marginTop: -100,     // Offset half the height (200/2 = 100)
     // Optional: Maintain aspect ratio
     resizeMode: 'cover',
-    transform: [{ translateY: 25 }],
+    transform: [],
   },
 });
