[NoCoverage] ArrowFunction
app/(tabs)/LandingScreen.tsx:15:48
             <View style={styles.header}>
                 <Image source={require('@/assets/images/pet_finder_logo_middle.jpeg')} style={styles.headerImage} />
                 <View style={styles.headerButtons}>
-                    <TouchableOpacity onPress={() => router.push("/LoginScreen")} style={styles.headerButton}>
+                    <TouchableOpacity onPress={() => undefined} style={styles.headerButton}>
                         <Text style={styles.headerButtonText}>Log In</Text>
                     </TouchableOpacity>

[NoCoverage] ArrowFunction
app/(tabs)/LandingScreen.tsx:18:48
                     <TouchableOpacity onPress={() => router.push("/LoginScreen")} style={styles.headerButton}>
                         <Text style={styles.headerButtonText}>Log In</Text>
                     </TouchableOpacity>
-                    <TouchableOpacity onPress={() => router.push("/LoginScreen")} style={styles.headerButton}>
+                    <TouchableOpacity onPress={() => undefined} style={styles.headerButton}>
                         <Text style={styles.headerButtonText}>Sign Up</Text>
                     </TouchableOpacity>

[NoCoverage] ArrowFunction
app/(tabs)/LandingScreen.tsx:41:48
                         We understand the emotional journey of losing a beloved pet, and we are dedicated to helping families
                         bring their pets home safely. By connecting lost pets with their rightful owners, we make sure that 
                         every pet has a second chance to be reunited with the people who love them.</Text>
-                    <TouchableOpacity onPress={() => router.push("/LoginScreen")} style={styles.trialButton}>
+                    <TouchableOpacity onPress={() => undefined} style={styles.trialButton}>
                         <Text style={styles.trialButtonText}>Join Us!</Text>
                     </TouchableOpacity>

[NoCoverage] ArrowFunction
app/(tabs)/LandingScreen.tsx:54:52
                 {/* Footer inside ScrollView */}
                 <View style={styles.footer}>
                     <View style={styles.footerLinks}>
-                        <TouchableOpacity onPress={() => Linking.openURL("https://drive.google.com/file/d/18bOKIcIvZCcyYcwF8iy6POVRgIo_G4HI/view?usp=sharing")}>
+                        <TouchableOpacity onPress={() => undefined}>
                             <Text style={styles.footerLink}>Contact Us</Text>
                         </TouchableOpacity>

[NoCoverage] ArrowFunction
app/(tabs)/LandingScreen.tsx:57:52
                         <TouchableOpacity onPress={() => Linking.openURL("https://drive.google.com/file/d/18bOKIcIvZCcyYcwF8iy6POVRgIo_G4HI/view?usp=sharing")}>
                             <Text style={styles.footerLink}>Contact Us</Text>
                         </TouchableOpacity>
-                        <TouchableOpacity onPress={() => Linking.openURL("https://drive.google.com/file/d/1mH6dYYX_B6VP9EqeZYgPi8I5mV8Anlos/view?usp=sharing")}>
+                        <TouchableOpacity onPress={() => undefined}>
                             <Text style={styles.footerLink}>FAQ</Text>
                         </TouchableOpacity>

[NoCoverage] ArrowFunction
app/(tabs)/LandingScreen.tsx:60:52
                         <TouchableOpacity onPress={() => Linking.openURL("https://drive.google.com/file/d/1mH6dYYX_B6VP9EqeZYgPi8I5mV8Anlos/view?usp=sharing")}>
                             <Text style={styles.footerLink}>FAQ</Text>
                         </TouchableOpacity>
-                        <TouchableOpacity onPress={() => Linking.openURL("https://drive.google.com/file/d/1Ln46Y94smCt7_cVET5Ey2R-ztHJHoz-I/view?usp=sharing")}>
+                        <TouchableOpacity onPress={() => undefined}>
                             <Text style={styles.footerLink}>Resources</Text>
                         </TouchableOpacity>

[NoCoverage] ArrowFunction
app/(tabs)/LandingScreen.tsx:63:52
                         <TouchableOpacity onPress={() => Linking.openURL("https://drive.google.com/file/d/1Ln46Y94smCt7_cVET5Ey2R-ztHJHoz-I/view?usp=sharing")}>
                             <Text style={styles.footerLink}>Resources</Text>
                         </TouchableOpacity>
-                        <TouchableOpacity onPress={() => Linking.openURL("https://drive.google.com/file/d/1szejtG6M6bdgzeFZpLOn3TOuaFo-EklF/view?usp=sharing")}>
+                        <TouchableOpacity onPress={() => undefined}>
                             <Text style={styles.footerLink}>Privacy Policy</Text>
                         </TouchableOpacity>

[NoCoverage] ObjectLiteral
app/(tabs)/LandingScreen.tsx:81:13
         flex: 1,
         backgroundColor: "#faf0dc",
     },
-    header: {
-        width: "100%",
-        padding: 20,
-        backgroundColor: "#FBF0DC",
-        alignItems: "center",
-        flexDirection: "row",
-        justifyContent: "space-between",
-        marginTop: 50,
-    },
+    header: {},
     headerImage: {
         width: 75,

[NoCoverage] StringLiteral
app/(tabs)/LandingScreen.tsx:87:25
         backgroundColor: "#FBF0DC",
         alignItems: "center",
         flexDirection: "row",
-        justifyContent: "space-between",
+        justifyContent: "",
         marginTop: 50,
     },

[NoCoverage] StringLiteral
app/(tabs)/LandingScreen.tsx:105:16
         marginLeft: 10,
     },
     headerButtonText: {
-        color: "#fff",
+        color: "",
         fontWeight: "bold",
     },

[NoCoverage] ObjectLiteral
app/(tabs)/LandingScreen.tsx:108:14
         color: "#fff",
         fontWeight: "bold",
     },
-    content: {
-        flexGrow: 1,  // Ensures content takes up available space
-        justifyContent: "center",
-        alignItems: "center",
-        padding: 20,
-    },
+    content: {},
     title: {
         fontSize: 32,

[NoCoverage] ObjectLiteral
app/(tabs)/LandingScreen.tsx:114:12
         alignItems: "center",
         padding: 20,
     },
-    title: {
-        fontSize: 32,
-        fontWeight: "bold",
-        marginBottom: 10,
-    },
+    title: {},
     subtitle: {
         fontSize: 18,

[NoCoverage] StringLiteral
app/(tabs)/LandingScreen.tsx:116:21
     },
     title: {
         fontSize: 32,
-        fontWeight: "bold",
+        fontWeight: "",
         marginBottom: 10,
     },

[NoCoverage] ObjectLiteral
app/(tabs)/LandingScreen.tsx:124:19
         marginBottom: 20,
         color: "#000",
     },
-    trialSection: {
-        marginTop: 20,
-        padding: 15,
-        backgroundColor: "#e8d8c4",
-        borderRadius: 10,
-        alignItems: "center",
-    },
+    trialSection: {},
     trialTitle: {
         fontSize: 20,

[NoCoverage] StringLiteral
app/(tabs)/LandingScreen.tsx:127:26
     trialSection: {
         marginTop: 20,
         padding: 15,
-        backgroundColor: "#e8d8c4",
+        backgroundColor: "",
         borderRadius: 10,
         alignItems: "center",

[NoCoverage] StringLiteral
app/(tabs)/LandingScreen.tsx:129:21
         padding: 15,
         backgroundColor: "#e8d8c4",
         borderRadius: 10,
-        alignItems: "center",
+        alignItems: "",
     },
     trialTitle: {

[NoCoverage] StringLiteral
app/(tabs)/LandingScreen.tsx:133:21
     },
     trialTitle: {
         fontSize: 20,
-        fontWeight: "bold",
+        fontWeight: "",
         marginBottom: 5,
     },

[NoCoverage] ObjectLiteral
app/(tabs)/LandingScreen.tsx:141:18
         textAlign: "center",
         marginBottom: 10,
     },
-    trialButton: {
-        backgroundColor: "#6b431f",
-        padding: 10,
-        borderRadius: 5,
-    },
+    trialButton: {},
     trialButtonText: {
         color: "#fff",

[NoCoverage] StringLiteral
app/(tabs)/LandingScreen.tsx:142:26
         marginBottom: 10,
     },
     trialButton: {
-        backgroundColor: "#6b431f",
+        backgroundColor: "",
         padding: 10,
         borderRadius: 5,

[NoCoverage] StringLiteral
app/(tabs)/LandingScreen.tsx:147:16
         borderRadius: 5,
     },
     trialButtonText: {
-        color: "#fff",
+        color: "",
         fontWeight: "bold",
     },

[NoCoverage] StringLiteral
app/(tabs)/LandingScreen.tsx:156:16
         marginBottom: 20, 
     },
     footer: {
-        width: "150%",
+        width: "",
         padding: 15,
         backgroundColor: "#6b431f",

[NoCoverage] StringLiteral
app/(tabs)/LandingScreen.tsx:158:26
     footer: {
         width: "150%",
         padding: 15,
-        backgroundColor: "#6b431f",
+        backgroundColor: "",
         alignItems: "center",
         marginTop: 20,  // added some space between content and footer

[NoCoverage] StringLiteral
app/(tabs)/LandingScreen.tsx:166:16
         marginBottom: 10, // space between links and copyright text
     },
     footerLink: {
-        color: "#fff",
+        color: "",
         fontSize: 16,
         marginBottom: 5,

[NoCoverage] ObjectLiteral
app/(tabs)/LandingScreen.tsx:175:24
         color: "#fff",
         fontSize: 14,
     },
-    additionalContent: {
-        marginTop: 20,
-        padding: 15,
-        backgroundColor: "#e8d8c4",
-        borderRadius: 10,
-        alignItems: "center",
-    },
+    additionalContent: {},
     additionalText: {
         fontSize: 16,

[NoCoverage] ObjectLiteral
app/(tabs)/LandingScreen.tsx:182:21
         borderRadius: 10,
         alignItems: "center",
     },
-    additionalText: {
-        fontSize: 16,
-        textAlign: "center",
-    },
+    additionalText: {},
     scrollView: {
         paddingBottom: 100, // Add extra space at the bottom to avoid covering by bottom navigation menu
