[Survived] UnaryOperator
app/(tabs)/MapScreen.tsx:31:14
  */
 const INITIAL_REGION = {
   latitude: 18.209533,
-  longitude: -67.140849,
+  longitude: +67.140849,
   latitudeDelta: 0.02922,
   longitudeDelta: 0.02421

[Survived] BlockStatement
app/(tabs)/MapScreen.tsx:39:7
 let startData = [] as Pet[]
 const fetchItems = async () => {
   console.log("Fetching Initial");
-  try {
-    let query = supabase
-      .from('pets')
-      .select('id, name, species, latitude, longitude, photo_url, description')
-      .order('created_at', { ascending: false })
-      .limit(3); // Maybe increase limit? 3 seems very low.
-
-    // Apply filters conditionally
-    
-
-    const { data, error: dbError } = await query;
-
-    if (dbError) {
-      throw dbError;
-    }
-
-    // console.log("Fetched Data:", data);
-    startData = data;
-
-    return 
-     // Set data or empty array if data is null/undefined
-
-  } catch (err: any) {
+  try {} catch (err: any) {
     console.error('Error fetching items:', err);
     Alert.alert("Error", `Failed to fetch items: ${err.message || 'Unknown error'}`);

[Survived] BooleanLiteral
app/(tabs)/MapScreen.tsx:43:41
     let query = supabase
       .from('pets')
       .select('id, name, species, latitude, longitude, photo_url, description')
-      .order('created_at', { ascending: false })
+      .order('created_at', { ascending: true })
       .limit(3); // Maybe increase limit? 3 seems very low.
 

[Survived] StringLiteral
app/(tabs)/MapScreen.tsx:43:14
     let query = supabase
       .from('pets')
       .select('id, name, species, latitude, longitude, photo_url, description')
-      .order('created_at', { ascending: false })
+      .order("", { ascending: false })
       .limit(3); // Maybe increase limit? 3 seems very low.
 

[NoCoverage] BlockStatement
app/(tabs)/MapScreen.tsx:51:18
 
     const { data, error: dbError } = await query;
 
-    if (dbError) {
-      throw dbError;
-    }
+    if (dbError) {}
 
     // console.log("Fetched Data:", data);

[NoCoverage] ConditionalExpression
app/(tabs)/MapScreen.tsx:51:9
 
     const { data, error: dbError } = await query;
 
-    if (dbError) {
+    if (false) {
       throw dbError;
     }

[NoCoverage] BlockStatement
app/(tabs)/MapScreen.tsx:61:22
     return 
      // Set data or empty array if data is null/undefined
 
-  } catch (err: any) {
-    console.error('Error fetching items:', err);
-    Alert.alert("Error", `Failed to fetch items: ${err.message || 'Unknown error'}`);
-  }
+  } catch (err: any) {}
 };
 

[NoCoverage] LogicalOperator
app/(tabs)/MapScreen.tsx:63:52
 
   } catch (err: any) {
     console.error('Error fetching items:', err);
-    Alert.alert("Error", `Failed to fetch items: ${err.message || 'Unknown error'}`);
+    Alert.alert("Error", `Failed to fetch items: ${err.message && 'Unknown error'}`);
   }
 };

[NoCoverage] ConditionalExpression
app/(tabs)/MapScreen.tsx:63:52
 
   } catch (err: any) {
     console.error('Error fetching items:', err);
-    Alert.alert("Error", `Failed to fetch items: ${err.message || 'Unknown error'}`);
+    Alert.alert("Error", `Failed to fetch items: ${false}`);
   }
 };

[Survived] StringLiteral
app/(tabs)/MapScreen.tsx:75:33
  */
 const styles = StyleSheet.create({
   container: { flex: 1 },
-  map: { width: "100%", height: "100%" },
+  map: { width: "100%", height: "" },
   header: { flexDirection: 'row', alignItems: 'center', backgroundColor: '#FBF0DC', marginTop: 50, padding: 10},
   searchBar: { flex: 1, height: 40, backgroundColor: '#fff', borderRadius: 5, paddingHorizontal: 10},

[Survived] ObjectLiteral
app/(tabs)/MapScreen.tsx:75:8
  */
 const styles = StyleSheet.create({
   container: { flex: 1 },
-  map: { width: "100%", height: "100%" },
+  map: {},
   header: { flexDirection: 'row', alignItems: 'center', backgroundColor: '#FBF0DC', marginTop: 50, padding: 10},
   searchBar: { flex: 1, height: 40, backgroundColor: '#fff', borderRadius: 5, paddingHorizontal: 10},

[Survived] StringLiteral
app/(tabs)/MapScreen.tsx:76:47
 const styles = StyleSheet.create({
   container: { flex: 1 },
   map: { width: "100%", height: "100%" },
-  header: { flexDirection: 'row', alignItems: 'center', backgroundColor: '#FBF0DC', marginTop: 50, padding: 10},
+  header: { flexDirection: 'row', alignItems: "", backgroundColor: '#FBF0DC', marginTop: 50, padding: 10},
   searchBar: { flex: 1, height: 40, backgroundColor: '#fff', borderRadius: 5, paddingHorizontal: 10},
   filterButton: { backgroundColor: '#6B431F', padding: 10, borderRadius: 5, margin: 5 },

[Survived] ObjectLiteral
app/(tabs)/MapScreen.tsx:79:16
   header: { flexDirection: 'row', alignItems: 'center', backgroundColor: '#FBF0DC', marginTop: 50, padding: 10},
   searchBar: { flex: 1, height: 40, backgroundColor: '#fff', borderRadius: 5, paddingHorizontal: 10},
   filterButton: { backgroundColor: '#6B431F', padding: 10, borderRadius: 5, margin: 5 },
-  clearButton: {backgroundColor: 'red', padding: 10, borderRadius: 5, margin: 5 },
+  clearButton: {},
   filterButtonText: { color: 'white', fontWeight: 'bold' },
   userLocationButton: {

[Survived] StringLiteral
app/(tabs)/MapScreen.tsx:80:51
   searchBar: { flex: 1, height: 40, backgroundColor: '#fff', borderRadius: 5, paddingHorizontal: 10},
   filterButton: { backgroundColor: '#6B431F', padding: 10, borderRadius: 5, margin: 5 },
   clearButton: {backgroundColor: 'red', padding: 10, borderRadius: 5, margin: 5 },
-  filterButtonText: { color: 'white', fontWeight: 'bold' },
+  filterButtonText: { color: 'white', fontWeight: "" },
   userLocationButton: {
     position: "absolute",

[Survived] ObjectLiteral
app/(tabs)/MapScreen.tsx:80:21
   searchBar: { flex: 1, height: 40, backgroundColor: '#fff', borderRadius: 5, paddingHorizontal: 10},
   filterButton: { backgroundColor: '#6B431F', padding: 10, borderRadius: 5, margin: 5 },
   clearButton: {backgroundColor: 'red', padding: 10, borderRadius: 5, margin: 5 },
-  filterButtonText: { color: 'white', fontWeight: 'bold' },
+  filterButtonText: {},
   userLocationButton: {
     position: "absolute",

[Survived] StringLiteral
app/(tabs)/MapScreen.tsx:83:13
   filterButtonText: { color: 'white', fontWeight: 'bold' },
   userLocationButton: {
     position: "absolute",
-    bottom: "12%",
+    bottom: "",
     right: "5%",
     backgroundColor: "#FBF0DC",

[Survived] StringLiteral
app/(tabs)/MapScreen.tsx:85:22
     position: "absolute",
     bottom: "12%",
     right: "5%",
-    backgroundColor: "#FBF0DC",
+    backgroundColor: "",
     width: 45,
     height: 45,

[Survived] ArithmeticOperator
app/(tabs)/MapScreen.tsx:88:19
     backgroundColor: "#FBF0DC",
     width: 45,
     height: 45,
-    borderRadius: 45 / 2,
+    borderRadius: 45 * 2,
     justifyContent: "center",
     alignItems: "center",

[Survived] StringLiteral
app/(tabs)/MapScreen.tsx:89:21
     width: 45,
     height: 45,
     borderRadius: 45 / 2,
-    justifyContent: "center",
+    justifyContent: "",
     alignItems: "center",
   },

[Survived] StringLiteral
app/(tabs)/MapScreen.tsx:95:17
   buttonImage: {
     width: 35,
     height: 35,
-    resizeMode: "contain",
+    resizeMode: "",
   }
 });

[Survived] BlockStatement
app/(tabs)/MapScreen.tsx:114:19
   /**
    * Effect hook to request location permissions and start tracking user location.
    */
-  useEffect(() => {
-    const startTracking = async () => {
-      let { status } = await Location.requestForegroundPermissionsAsync();
-      if (status !== "granted") return;
-
-      locationSubscription = await Location.watchPositionAsync(
-        { accuracy: Location.Accuracy.High, timeInterval: 10000, distanceInterval: 10 },
-        (location) => setUserLocation(location)
-      );
-    };
-
-    startTracking();
-    return () => { locationSubscription?.remove(); };
-  }, []);
+  useEffect(() => {}, []);
 
   /**

[Survived] BlockStatement
app/(tabs)/MapScreen.tsx:115:39
    * Effect hook to request location permissions and start tracking user location.
    */
   useEffect(() => {
-    const startTracking = async () => {
-      let { status } = await Location.requestForegroundPermissionsAsync();
-      if (status !== "granted") return;
-
-      locationSubscription = await Location.watchPositionAsync(
-        { accuracy: Location.Accuracy.High, timeInterval: 10000, distanceInterval: 10 },
-        (location) => setUserLocation(location)
-      );
-    };
+    const startTracking = async () => {};
 
     startTracking();

[Survived] ConditionalExpression
app/(tabs)/MapScreen.tsx:117:11
   useEffect(() => {
     const startTracking = async () => {
       let { status } = await Location.requestForegroundPermissionsAsync();
-      if (status !== "granted") return;
+      if (true) return;
 
       locationSubscription = await Location.watchPositionAsync(

[Survived] ConditionalExpression
app/(tabs)/MapScreen.tsx:117:11
   useEffect(() => {
     const startTracking = async () => {
       let { status } = await Location.requestForegroundPermissionsAsync();
-      if (status !== "granted") return;
+      if (false) return;
 
       locationSubscription = await Location.watchPositionAsync(

[Survived] ArrowFunction
app/(tabs)/MapScreen.tsx:121:9
 
       locationSubscription = await Location.watchPositionAsync(
         { accuracy: Location.Accuracy.High, timeInterval: 10000, distanceInterval: 10 },
-        (location) => setUserLocation(location)
+        () => undefined
       );
     };

[Survived] OptionalChaining
app/(tabs)/MapScreen.tsx:126:20
     };
 
     startTracking();
-    return () => { locationSubscription?.remove(); };
+    return () => { locationSubscription.remove(); };
   }, []);
 

[Survived] BlockStatement
app/(tabs)/MapScreen.tsx:126:18
     };
 
     startTracking();
-    return () => { locationSubscription?.remove(); };
+    return () => {};
   }, []);
 

[Survived] StringLiteral
app/(tabs)/MapScreen.tsx:134:19
    */
   useEffect(() => {
     const fetchItems = async () => {
-      console.log("Fetching with filter:", selectedFilter, "?? query:", searchQuery);
+      console.log("", selectedFilter, "?? query:", searchQuery);
       try {
         let query = supabase

[Survived] StringLiteral
app/(tabs)/MapScreen.tsx:134:60
    */
   useEffect(() => {
     const fetchItems = async () => {
-      console.log("Fetching with filter:", selectedFilter, "?? query:", searchQuery);
+      console.log("Fetching with filter:", selectedFilter, "", searchQuery);
       try {
         let query = supabase

[Survived] StringLiteral
app/(tabs)/MapScreen.tsx:138:19
       try {
         let query = supabase
           .from('pets')
-          .select('id, name, species, latitude, longitude, photo_url, description')
+          .select("")
           .order('created_at', { ascending: false })
           .limit(3); // Maybe increase limit? 3 seems very low.

[Survived] BlockStatement
app/(tabs)/MapScreen.tsx:143:29
           .limit(3); // Maybe increase limit? 3 seems very low.
   
         // Apply filters conditionally
-        if (selectedFilter) { // Check if filter is not empty string
-          query = query.eq('species', selectedFilter.toLowerCase());
-        }
+        if (selectedFilter) {}
         if (searchQuery) { // Check if query is not empty string
           query = query.ilike('name', `%${searchQuery}%`);

[Survived] ConditionalExpression
app/(tabs)/MapScreen.tsx:143:13
           .limit(3); // Maybe increase limit? 3 seems very low.
   
         // Apply filters conditionally
-        if (selectedFilter) { // Check if filter is not empty string
+        if (false) { // Check if filter is not empty string
           query = query.eq('species', selectedFilter.toLowerCase());
         }

[Survived] MethodExpression
app/(tabs)/MapScreen.tsx:144:39
   
         // Apply filters conditionally
         if (selectedFilter) { // Check if filter is not empty string
-          query = query.eq('species', selectedFilter.toLowerCase());
+          query = query.eq('species', selectedFilter.toUpperCase());
         }
         if (searchQuery) { // Check if query is not empty string

[Survived] ConditionalExpression
app/(tabs)/MapScreen.tsx:146:13
         if (selectedFilter) { // Check if filter is not empty string
           query = query.eq('species', selectedFilter.toLowerCase());
         }
-        if (searchQuery) { // Check if query is not empty string
+        if (false) { // Check if query is not empty string
           query = query.ilike('name', `%${searchQuery}%`);
         }

[NoCoverage] BlockStatement
app/(tabs)/MapScreen.tsx:146:26
         if (selectedFilter) { // Check if filter is not empty string
           query = query.eq('species', selectedFilter.toLowerCase());
         }
-        if (searchQuery) { // Check if query is not empty string
-          query = query.ilike('name', `%${searchQuery}%`);
-        }
+        if (searchQuery) {}
   
         const { data, error: dbError } = await query;

[NoCoverage] ConditionalExpression
app/(tabs)/MapScreen.tsx:152:13
   
         const { data, error: dbError } = await query;
   
-        if (dbError) {
+        if (true) {
           throw dbError;
         }

[NoCoverage] BlockStatement
app/(tabs)/MapScreen.tsx:160:26
         setData(data);
          // Set data or empty array if data is null/undefined
   
-      } catch (err: any) {
-        console.error('Error fetching items:', err);
-        setData([]); // Clear data on error
-        Alert.alert("Error", `Failed to fetch items: ${err.message || 'Unknown error'}`);
-      }
+      } catch (err: any) {}
     };
   

[NoCoverage] LogicalOperator
app/(tabs)/MapScreen.tsx:163:56
       } catch (err: any) {
         console.error('Error fetching items:', err);
         setData([]); // Clear data on error
-        Alert.alert("Error", `Failed to fetch items: ${err.message || 'Unknown error'}`);
+        Alert.alert("Error", `Failed to fetch items: ${err.message && 'Unknown error'}`);
       }
     };

[NoCoverage] ConditionalExpression
app/(tabs)/MapScreen.tsx:163:56
       } catch (err: any) {
         console.error('Error fetching items:', err);
         setData([]); // Clear data on error
-        Alert.alert("Error", `Failed to fetch items: ${err.message || 'Unknown error'}`);
+        Alert.alert("Error", `Failed to fetch items: ${true}`);
       }
     };

[Killed] BlockStatement
app/(tabs)/MapScreen.tsx:170:19
     fetchItems();
   }, [selectedFilter, searchQuery]); // Dependencies are correct
 
-  useEffect(() => {
-    (async () => {
-      let {status} = await Location.requestForegroundPermissionsAsync();
-      if(status != 'granted') {
-        return;
-      }
-      let userLocation = await Location.getCurrentPositionAsync({
-        accuracy: Location.Accuracy.Balanced,
-        timeInterval: 5,
-      });
-      setUserLocation(userLocation);
-    }) ();
-  }, []);
+  useEffect(() => {}, []);
 
   const goToCurrentLocation = async () => {
killedBy: MapScreen handles user location button press
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
app/(tabs)/MapScreen.tsx:171:18
   }, [selectedFilter, searchQuery]); // Dependencies are correct
 
   useEffect(() => {
-    (async () => {
-      let {status} = await Location.requestForegroundPermissionsAsync();
-      if(status != 'granted') {
-        return;
-      }
-      let userLocation = await Location.getCurrentPositionAsync({
-        accuracy: Location.Accuracy.Balanced,
-        timeInterval: 5,
-      });
-      setUserLocation(userLocation);
-    }) ();
+    (async () => {}) ();
   }, []);
 
killedBy: MapScreen handles user location button press
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] EqualityOperator
app/(tabs)/MapScreen.tsx:173:10
   useEffect(() => {
     (async () => {
       let {status} = await Location.requestForegroundPermissionsAsync();
-      if(status != 'granted') {
+      if(status == 'granted') {
         return;
       }
killedBy: MapScreen handles user location button press
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
app/(tabs)/MapScreen.tsx:173:10
   useEffect(() => {
     (async () => {
       let {status} = await Location.requestForegroundPermissionsAsync();
-      if(status != 'granted') {
+      if(true) {
         return;
       }
killedBy: MapScreen handles user location button press
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] BlockStatement
app/(tabs)/MapScreen.tsx:184:43
     }) ();
   }, []);
 
-  const goToCurrentLocation = async () => {
-    if(userLocation && mapRef.current) {
-      mapRef.current.animateCamera({
-        center: {
-          latitude: userLocation.coords.latitude,
-          longitude: userLocation.coords.longitude,
-        },
-        altitude: 2000,
-        zoom: 15,
-      });
-    }
-  };
+  const goToCurrentLocation = async () => {};
 
   return (

[Killed] ConditionalExpression
app/(tabs)/MapScreen.tsx:185:8
   }, []);
 
   const goToCurrentLocation = async () => {
-    if(userLocation && mapRef.current) {
+    if(true) {
       mapRef.current.animateCamera({
         center: {
killedBy: MapScreen handles user location button press
statusReason: TypeError: Cannot read properties of null (reading 'coords')

[Killed] LogicalOperator
app/(tabs)/MapScreen.tsx:185:8
   }, []);
 
   const goToCurrentLocation = async () => {
-    if(userLocation && mapRef.current) {
+    if(userLocation || mapRef.current) {
       mapRef.current.animateCamera({
         center: {
killedBy: MapScreen handles user location button press
statusReason: TypeError: Cannot read properties of null (reading 'coords')

[Survived] StringLiteral
app/(tabs)/MapScreen.tsx:211:60
       </View>
 
       {/* Filter Buttons for Pet Type */}
-      <View style={{ flexDirection: 'row', justifyContent: 'space-around', padding: 10 ,backgroundColor: '#FBF0DC'}}>
+      <View style={{ flexDirection: 'row', justifyContent: "", padding: 10 ,backgroundColor: '#FBF0DC'}}>
         {['Dog', 'Cat', 'Others','Clear'].map(filter => (
           <TouchableOpacity key={filter} style={filter === "Clear" ? styles.clearButton: styles.filterButton} onPress={() => filter === "Clear" ? setSelectedFilter("") : setSelectedFilter(filter)}>

[Survived] ObjectLiteral
app/(tabs)/MapScreen.tsx:211:20
       </View>
 
       {/* Filter Buttons for Pet Type */}
-      <View style={{ flexDirection: 'row', justifyContent: 'space-around', padding: 10 ,backgroundColor: '#FBF0DC'}}>
+      <View style={{}}>
         {['Dog', 'Cat', 'Others','Clear'].map(filter => (
           <TouchableOpacity key={filter} style={filter === "Clear" ? styles.clearButton: styles.filterButton} onPress={() => filter === "Clear" ? setSelectedFilter("") : setSelectedFilter(filter)}>

[Killed] ArrowFunction
app/(tabs)/MapScreen.tsx:212:47
 
       {/* Filter Buttons for Pet Type */}
       <View style={{ flexDirection: 'row', justifyContent: 'space-around', padding: 10 ,backgroundColor: '#FBF0DC'}}>
-        {['Dog', 'Cat', 'Others','Clear'].map(filter => (
-          <TouchableOpacity key={filter} style={filter === "Clear" ? styles.clearButton: styles.filterButton} onPress={() => filter === "Clear" ? setSelectedFilter("") : setSelectedFilter(filter)}>
-            <Text style={styles.filterButtonText}>{filter}</Text>
-          </TouchableOpacity>
-        ))}
+        {['Dog', 'Cat', 'Others','Clear'].map(() => undefined)}
       </View>
 
killedBy: MapScreen renders search bar and filter buttons
statusReason: Error: Unable to find an element with text: Dog

<View>
  <View>
    <Image />
    <TextInput
      placeholder="Search..."
    />

[Killed] StringLiteral
app/(tabs)/MapScreen.tsx:212:25
 
       {/* Filter Buttons for Pet Type */}
       <View style={{ flexDirection: 'row', justifyContent: 'space-around', padding: 10 ,backgroundColor: '#FBF0DC'}}>
-        {['Dog', 'Cat', 'Others','Clear'].map(filter => (
+        {['Dog', 'Cat', "",'Clear'].map(filter => (
           <TouchableOpacity key={filter} style={filter === "Clear" ? styles.clearButton: styles.filterButton} onPress={() => filter === "Clear" ? setSelectedFilter("") : setSelectedFilter(filter)}>
             <Text style={styles.filterButtonText}>{filter}</Text>
killedBy: MapScreen renders search bar and filter buttons
statusReason: Error: Unable to find an element with text: Others

<View>
  <View>
    <Image />
    <TextInput
      placeholder="Search..."
    />

[Survived] ConditionalExpression
app/(tabs)/MapScreen.tsx:213:49
       {/* Filter Buttons for Pet Type */}
       <View style={{ flexDirection: 'row', justifyContent: 'space-around', padding: 10 ,backgroundColor: '#FBF0DC'}}>
         {['Dog', 'Cat', 'Others','Clear'].map(filter => (
-          <TouchableOpacity key={filter} style={filter === "Clear" ? styles.clearButton: styles.filterButton} onPress={() => filter === "Clear" ? setSelectedFilter("") : setSelectedFilter(filter)}>
+          <TouchableOpacity key={filter} style={true ? styles.clearButton: styles.filterButton} onPress={() => filter === "Clear" ? setSelectedFilter("") : setSelectedFilter(filter)}>
             <Text style={styles.filterButtonText}>{filter}</Text>
           </TouchableOpacity>

[Survived] ConditionalExpression
app/(tabs)/MapScreen.tsx:213:126
       {/* Filter Buttons for Pet Type */}
       <View style={{ flexDirection: 'row', justifyContent: 'space-around', padding: 10 ,backgroundColor: '#FBF0DC'}}>
         {['Dog', 'Cat', 'Others','Clear'].map(filter => (
-          <TouchableOpacity key={filter} style={filter === "Clear" ? styles.clearButton: styles.filterButton} onPress={() => filter === "Clear" ? setSelectedFilter("") : setSelectedFilter(filter)}>
+          <TouchableOpacity key={filter} style={filter === "Clear" ? styles.clearButton: styles.filterButton} onPress={() => true ? setSelectedFilter("") : setSelectedFilter(filter)}>
             <Text style={styles.filterButtonText}>{filter}</Text>
           </TouchableOpacity>

[Survived] BooleanLiteral
app/(tabs)/MapScreen.tsx:220:79
       </View>
 
       {/* Map View with Pet Markers */}
-      <MapView ref={mapRef} initialRegion={INITIAL_REGION} showsUserLocation={true} style={styles.map}>
+      <MapView ref={mapRef} initialRegion={INITIAL_REGION} showsUserLocation={false} style={styles.map}>
         {dataActual.map((pet: Pet) => (
           <Marker

[Survived] ArrowFunction
app/(tabs)/MapScreen.tsx:221:25
 
       {/* Map View with Pet Markers */}
       <MapView ref={mapRef} initialRegion={INITIAL_REGION} showsUserLocation={true} style={styles.map}>
-        {dataActual.map((pet: Pet) => (
-          <Marker
-            key={pet.id}
-
-            coordinate={{latitude : pet.latitude ,  longitude: pet.longitude}}
-            image={pet.species === 'dog' ? require("../../assets/images/Pet_Finder_Assets/Pet_DogMarker.png") : require("../../assets/images/Pet_Finder_Assets/Pet_CatMarker.png")}
-
-          >
-            <Callout>
-              <Descriptor {...pet} />
-            </Callout>
-          </Marker>
-        ))}
+        {dataActual.map(() => undefined)}
       </MapView>
       <TouchableOpacity testID="userLocationButton" style={styles.userLocationButton} onPress={goToCurrentLocation}>

[NoCoverage] ObjectLiteral
app/(tabs)/MapScreen.tsx:225:25
           <Marker
             key={pet.id}
 
-            coordinate={{latitude : pet.latitude ,  longitude: pet.longitude}}
+            coordinate={{}}
             image={pet.species === 'dog' ? require("../../assets/images/Pet_Finder_Assets/Pet_DogMarker.png") : require("../../assets/images/Pet_Finder_Assets/Pet_CatMarker.png")}
 

[NoCoverage] ConditionalExpression
app/(tabs)/MapScreen.tsx:226:20
             key={pet.id}
 
             coordinate={{latitude : pet.latitude ,  longitude: pet.longitude}}
-            image={pet.species === 'dog' ? require("../../assets/images/Pet_Finder_Assets/Pet_DogMarker.png") : require("../../assets/images/Pet_Finder_Assets/Pet_CatMarker.png")}
+            image={false ? require("../../assets/images/Pet_Finder_Assets/Pet_DogMarker.png") : require("../../assets/images/Pet_Finder_Assets/Pet_CatMarker.png")}
 
           >

[NoCoverage] EqualityOperator
app/(tabs)/MapScreen.tsx:226:20
             key={pet.id}
 
             coordinate={{latitude : pet.latitude ,  longitude: pet.longitude}}
-            image={pet.species === 'dog' ? require("../../assets/images/Pet_Finder_Assets/Pet_DogMarker.png") : require("../../assets/images/Pet_Finder_Assets/Pet_CatMarker.png")}
+            image={pet.species !== 'dog' ? require("../../assets/images/Pet_Finder_Assets/Pet_DogMarker.png") : require("../../assets/images/Pet_Finder_Assets/Pet_CatMarker.png")}
 
           >
