[NoCoverage] BooleanLiteral
app/(tabs)/profile.tsx:19:46
 
 export default function ProfileScreen() {
   const router = useRouter();
-  const [isEditing, setIsEditing] = useState(false);
+  const [isEditing, setIsEditing] = useState(true);
   const [passwordVisible, setPasswordVisible] = useState(false);
   const [profileImage, setProfileImage] = useState<string | null>(null); // No image initially

[NoCoverage] BooleanLiteral
app/(tabs)/profile.tsx:20:58
 export default function ProfileScreen() {
   const router = useRouter();
   const [isEditing, setIsEditing] = useState(false);
-  const [passwordVisible, setPasswordVisible] = useState(false);
+  const [passwordVisible, setPasswordVisible] = useState(true);
   const [profileImage, setProfileImage] = useState<string | null>(null); // No image initially
 

[NoCoverage] StringLiteral
app/(tabs)/profile.tsx:25:12
 
   const [user, setUser] = useState({
     name: "Student Name",
-    email: "manuellopez@upr.edu",
+    email: "",
     dob: "18/03/2024",
     phone: "(454) 726-0592",

[NoCoverage] BlockStatement
app/(tabs)/profile.tsx:31:69
     password: "********",
   });
 
-  const handleChange = (field: keyof typeof user, value: string) => {
-    setUser({ ...user, [field]: value });
-  };
+  const handleChange = (field: keyof typeof user, value: string) => {};
 
   // Function to pick an image from the gallery

[NoCoverage] BlockStatement
app/(tabs)/profile.tsx:36:33
   };
 
   // Function to pick an image from the gallery
-  const pickImage = async () => {
-    let permissionResult =
-      await ImagePicker.requestMediaLibraryPermissionsAsync();
-    if (!permissionResult.granted) {
-      alert("Permission to access gallery is required!");
-      return;
-    }
-
-    let result = await ImagePicker.launchImageLibraryAsync({
-      mediaTypes: ImagePicker.MediaTypeOptions.Images,
-      allowsEditing: true,
-      aspect: [1, 1],
-      quality: 1,
-    });
-
-    if (!result.canceled) {
-      setProfileImage(result.assets[0].uri);
-    }
-  };
+  const pickImage = async () => {};
 
   return (

[NoCoverage] ConditionalExpression
app/(tabs)/profile.tsx:39:9
   const pickImage = async () => {
     let permissionResult =
       await ImagePicker.requestMediaLibraryPermissionsAsync();
-    if (!permissionResult.granted) {
+    if (true) {
       alert("Permission to access gallery is required!");
       return;

[NoCoverage] BooleanLiteral
app/(tabs)/profile.tsx:39:9
   const pickImage = async () => {
     let permissionResult =
       await ImagePicker.requestMediaLibraryPermissionsAsync();
-    if (!permissionResult.granted) {
+    if (permissionResult.granted) {
       alert("Permission to access gallery is required!");
       return;

[NoCoverage] BooleanLiteral
app/(tabs)/profile.tsx:46:22
 
     let result = await ImagePicker.launchImageLibraryAsync({
       mediaTypes: ImagePicker.MediaTypeOptions.Images,
-      allowsEditing: true,
+      allowsEditing: false,
       aspect: [1, 1],
       quality: 1,

[NoCoverage] ArrayDeclaration
app/(tabs)/profile.tsx:47:15
     let result = await ImagePicker.launchImageLibraryAsync({
       mediaTypes: ImagePicker.MediaTypeOptions.Images,
       allowsEditing: true,
-      aspect: [1, 1],
+      aspect: [],
       quality: 1,
     });

[NoCoverage] BooleanLiteral
app/(tabs)/profile.tsx:51:9
       quality: 1,
     });
 
-    if (!result.canceled) {
+    if (result.canceled) {
       setProfileImage(result.assets[0].uri);
     }

[NoCoverage] ConditionalExpression
app/(tabs)/profile.tsx:51:9
       quality: 1,
     });
 
-    if (!result.canceled) {
+    if (false) {
       setProfileImage(result.assets[0].uri);
     }

[NoCoverage] ArrowFunction
app/(tabs)/profile.tsx:60:36
     <View style={styles.container}>
       {/* Header */}
       <View style={styles.header}>
-        <TouchableOpacity onPress={() => router.back()}>
+        <TouchableOpacity onPress={() => undefined}>
           <Ionicons name="arrow-back" size={24} color="black" />
         </TouchableOpacity>

[NoCoverage] ObjectLiteral
app/(tabs)/profile.tsx:70:34
 
       <View style={styles.profileContainer}>
         <Image
-          source={profileImage ? { uri: profileImage } : ProfileImagePlaceholder}
+          source={profileImage ? {} : ProfileImagePlaceholder}
           style={styles.profileImage}
         />

[NoCoverage] LogicalOperator
app/(tabs)/profile.tsx:80:30
 
       {/* User Name */}
       <TextInput
-        style={[styles.name, isEditing && styles.editable]}
+        style={[styles.name, isEditing || styles.editable]}
         value={user.name}
         onChangeText={(text) => handleChange("name", text)}

[NoCoverage] ConditionalExpression
app/(tabs)/profile.tsx:80:30
 
       {/* User Name */}
       <TextInput
-        style={[styles.name, isEditing && styles.editable]}
+        style={[styles.name, false]}
         value={user.name}
         onChangeText={(text) => handleChange("name", text)}

[NoCoverage] ArrowFunction
app/(tabs)/profile.tsx:82:23
       <TextInput
         style={[styles.name, isEditing && styles.editable]}
         value={user.name}
-        onChangeText={(text) => handleChange("name", text)}
+        onChangeText={() => undefined}
         editable={isEditing}
       />

[NoCoverage] ConditionalExpression
app/(tabs)/profile.tsx:90:33
       <View style={styles.inputContainer}>
         <Text style={styles.label}>Email</Text>
         <TextInput
-          style={[styles.input, isEditing && styles.editable]}
+          style={[styles.input, true]}
           value={user.email}
           onChangeText={(text) => handleChange("email", text)}

[NoCoverage] LogicalOperator
app/(tabs)/profile.tsx:90:33
       <View style={styles.inputContainer}>
         <Text style={styles.label}>Email</Text>
         <TextInput
-          style={[styles.input, isEditing && styles.editable]}
+          style={[styles.input, isEditing || styles.editable]}
           value={user.email}
           onChangeText={(text) => handleChange("email", text)}

[NoCoverage] ArrowFunction
app/(tabs)/profile.tsx:92:25
         <TextInput
           style={[styles.input, isEditing && styles.editable]}
           value={user.email}
-          onChangeText={(text) => handleChange("email", text)}
+          onChangeText={() => undefined}
           editable={isEditing}
           keyboardType="email-address"

[NoCoverage] StringLiteral
app/(tabs)/profile.tsx:92:48
         <TextInput
           style={[styles.input, isEditing && styles.editable]}
           value={user.email}
-          onChangeText={(text) => handleChange("email", text)}
+          onChangeText={(text) => handleChange("", text)}
           editable={isEditing}
           keyboardType="email-address"

[NoCoverage] ConditionalExpression
app/(tabs)/profile.tsx:100:45
 
       <View style={styles.inputContainer}>
         <Text style={styles.label}>Date of Birth</Text>
-        <View style={[styles.inputWithIcon, isEditing && styles.editable]}>
+        <View style={[styles.inputWithIcon, false]}>
           <TextInput
             style={[styles.inputField, { flex: 1 }]}

[NoCoverage] LogicalOperator
app/(tabs)/profile.tsx:100:45
 
       <View style={styles.inputContainer}>
         <Text style={styles.label}>Date of Birth</Text>
-        <View style={[styles.inputWithIcon, isEditing && styles.editable]}>
+        <View style={[styles.inputWithIcon, isEditing || styles.editable]}>
           <TextInput
             style={[styles.inputField, { flex: 1 }]}

[NoCoverage] ArrayDeclaration
app/(tabs)/profile.tsx:102:20
         <Text style={styles.label}>Date of Birth</Text>
         <View style={[styles.inputWithIcon, isEditing && styles.editable]}>
           <TextInput
-            style={[styles.inputField, { flex: 1 }]}
+            style={[]}
             value={user.dob}
             onChangeText={(text) => handleChange("dob", text)}

[NoCoverage] ArrowFunction
app/(tabs)/profile.tsx:104:27
           <TextInput
             style={[styles.inputField, { flex: 1 }]}
             value={user.dob}
-            onChangeText={(text) => handleChange("dob", text)}
+            onChangeText={() => undefined}
             editable={isEditing}
           />

[NoCoverage] StringLiteral
app/(tabs)/profile.tsx:110:32
           <Ionicons
             name="calendar-outline"
             size={20}
-            color={isEditing ? "black" : "gray"}
+            color={isEditing ? "" : "gray"}
           />
         </View>

[NoCoverage] ArrowFunction
app/(tabs)/profile.tsx:120:25
         <TextInput
           style={[styles.input, isEditing && styles.editable]}
           value={user.phone}
-          onChangeText={(text) => handleChange("phone", text)}
+          onChangeText={() => undefined}
           editable={isEditing}
           keyboardType="phone-pad"

[NoCoverage] StringLiteral
app/(tabs)/profile.tsx:120:48
         <TextInput
           style={[styles.input, isEditing && styles.editable]}
           value={user.phone}
-          onChangeText={(text) => handleChange("phone", text)}
+          onChangeText={(text) => handleChange("", text)}
           editable={isEditing}
           keyboardType="phone-pad"

[NoCoverage] LogicalOperator
app/(tabs)/profile.tsx:128:45
 
       <View style={styles.inputContainer}>
         <Text style={styles.label}>Password</Text>
-        <View style={[styles.inputWithIcon, isEditing && styles.editable]}>
+        <View style={[styles.inputWithIcon, isEditing || styles.editable]}>
           <TextInput
             style={[styles.inputField, { flex: 1 }]}

[NoCoverage] ConditionalExpression
app/(tabs)/profile.tsx:128:45
 
       <View style={styles.inputContainer}>
         <Text style={styles.label}>Password</Text>
-        <View style={[styles.inputWithIcon, isEditing && styles.editable]}>
+        <View style={[styles.inputWithIcon, true]}>
           <TextInput
             style={[styles.inputField, { flex: 1 }]}

[NoCoverage] ObjectLiteral
app/(tabs)/profile.tsx:130:40
         <Text style={styles.label}>Password</Text>
         <View style={[styles.inputWithIcon, isEditing && styles.editable]}>
           <TextInput
-            style={[styles.inputField, { flex: 1 }]}
+            style={[styles.inputField, {}]}
             value={user.password}
             secureTextEntry={!passwordVisible}

[NoCoverage] BooleanLiteral
app/(tabs)/profile.tsx:132:30
           <TextInput
             style={[styles.inputField, { flex: 1 }]}
             value={user.password}
-            secureTextEntry={!passwordVisible}
+            secureTextEntry={passwordVisible}
             editable={isEditing}
             onChangeText={(text) => handleChange("password", text)}

[NoCoverage] ArrowFunction
app/(tabs)/profile.tsx:134:27
             value={user.password}
             secureTextEntry={!passwordVisible}
             editable={isEditing}
-            onChangeText={(text) => handleChange("password", text)}
+            onChangeText={() => undefined}
           />
           <TouchableOpacity

[NoCoverage] ArrowFunction
app/(tabs)/profile.tsx:137:22
             onChangeText={(text) => handleChange("password", text)}
           />
           <TouchableOpacity
-            onPress={() => setPasswordVisible(!passwordVisible)}
+            onPress={() => undefined}
           >
             <Ionicons

[NoCoverage] BooleanLiteral
app/(tabs)/profile.tsx:137:47
             onChangeText={(text) => handleChange("password", text)}
           />
           <TouchableOpacity
-            onPress={() => setPasswordVisible(!passwordVisible)}
+            onPress={() => setPasswordVisible(passwordVisible)}
           >
             <Ionicons

[NoCoverage] StringLiteral
app/(tabs)/profile.tsx:140:59
             onPress={() => setPasswordVisible(!passwordVisible)}
           >
             <Ionicons
-              name={passwordVisible ? "eye-off-outline" : "eye-outline"}
+              name={passwordVisible ? "eye-off-outline" : ""}
               size={20}
               color={isEditing ? "black" : "gray"}

[NoCoverage] ConditionalExpression
app/(tabs)/profile.tsx:149:8
       </View>
 
       {/* Save Button */}
-      {isEditing && (
-        <TouchableOpacity
-          style={styles.saveButton}
-          onPress={() => setIsEditing(false)}
-        >
-          <Text style={styles.saveText}>Save Changes</Text>
-        </TouchableOpacity>
-      )}
+      {false}
 
       {/* Logout Button */}

[NoCoverage] ConditionalExpression
app/(tabs)/profile.tsx:149:8
       </View>
 
       {/* Save Button */}
-      {isEditing && (
-        <TouchableOpacity
-          style={styles.saveButton}
-          onPress={() => setIsEditing(false)}
-        >
-          <Text style={styles.saveText}>Save Changes</Text>
-        </TouchableOpacity>
-      )}
+      {true}
 
       {/* Logout Button */}

[NoCoverage] BooleanLiteral
app/(tabs)/profile.tsx:152:39
       {isEditing && (
         <TouchableOpacity
           style={styles.saveButton}
-          onPress={() => setIsEditing(false)}
+          onPress={() => setIsEditing(true)}
         >
           <Text style={styles.saveText}>Save Changes</Text>

[NoCoverage] ArrowFunction
app/(tabs)/profile.tsx:152:20
       {isEditing && (
         <TouchableOpacity
           style={styles.saveButton}
-          onPress={() => setIsEditing(false)}
+          onPress={() => undefined}
         >
           <Text style={styles.saveText}>Save Changes</Text>

[NoCoverage] ObjectLiteral
app/(tabs)/profile.tsx:182:17
     alignItems: "center",
     marginBottom: 10,
   },
-  profileImage: {
-    width: 150,
-    height: 150,
-    borderRadius: 80,
-  },
+  profileImage: {},
   editIcon: {
     position: "absolute",

[NoCoverage] StringLiteral
app/(tabs)/profile.tsx:188:15
     borderRadius: 80,
   },
   editIcon: {
-    position: "absolute",
+    position: "",
     bottom: 10,
     right: 10,

[NoCoverage] StringLiteral
app/(tabs)/profile.tsx:191:22
     position: "absolute",
     bottom: 10,
     right: 10,
-    backgroundColor: "#16A849",
+    backgroundColor: "",
     borderRadius: 20,
     padding: 6,

[NoCoverage] ObjectLiteral
app/(tabs)/profile.tsx:202:19
     textAlign: "center",
     marginBottom: 20,
   },
-  inputContainer: {
-    marginBottom: 15,
-  },
+  inputContainer: {},
   label: {
     fontSize: 14,

[NoCoverage] ObjectLiteral
app/(tabs)/profile.tsx:205:10
   inputContainer: {
     marginBottom: 15,
   },
-  label: {
-    fontSize: 14,
-    color: "gray",
-    marginBottom: 5,
-  },
+  label: {},
   input: {
     backgroundColor: "#FFF",

[NoCoverage] StringLiteral
app/(tabs)/profile.tsx:207:12
   },
   label: {
     fontSize: 14,
-    color: "gray",
+    color: "",
     marginBottom: 5,
   },

[NoCoverage] ObjectLiteral
app/(tabs)/profile.tsx:210:10
     color: "gray",
     marginBottom: 5,
   },
-  input: {
-    backgroundColor: "#FFF",
-    padding: 12,
-    borderRadius: 8,
-    borderWidth: 1,
-    borderColor: "#E0E0E0",
-  },
+  input: {},
   inputWithIcon: {
     flexDirection: "row",

[NoCoverage] ObjectLiteral
app/(tabs)/profile.tsx:217:18
     borderWidth: 1,
     borderColor: "#E0E0E0",
   },
-  inputWithIcon: {
-    flexDirection: "row",
-    alignItems: "center",
-    backgroundColor: "#FFF",
-    padding: 12,
-    borderRadius: 8,
-    borderWidth: 1,
-    borderColor: "#E0E0E0",
-    justifyContent: "space-between",
-  },
+  inputWithIcon: {},
   inputField: {
     fontSize: 16,

[NoCoverage] ObjectLiteral
app/(tabs)/profile.tsx:230:13
   inputField: {
     fontSize: 16,
   },
-  editable: {
-    borderWidth: 2,
-    borderColor: "#16A849",
-    backgroundColor: "#F8F8F8",
-    paddingHorizontal: 5,
-  },
+  editable: {},
   saveButton: {
     marginTop: 20,

[NoCoverage] StringLiteral
app/(tabs)/profile.tsx:232:18
   },
   editable: {
     borderWidth: 2,
-    borderColor: "#16A849",
+    borderColor: "",
     backgroundColor: "#F8F8F8",
     paddingHorizontal: 5,

[NoCoverage] StringLiteral
app/(tabs)/profile.tsx:244:12
     alignItems: "center",
   },
   saveText: {
-    color: "white",
+    color: "",
     fontWeight: "bold",
   },

[NoCoverage] StringLiteral
app/(tabs)/profile.tsx:245:17
   },
   saveText: {
     color: "white",
-    fontWeight: "bold",
+    fontWeight: "",
   },
   logoutButton: {

[NoCoverage] StringLiteral
app/(tabs)/profile.tsx:249:22
   },
   logoutButton: {
     marginTop: 20,
-    backgroundColor: "white",
+    backgroundColor: "",
     borderWidth: 1,
     borderColor: "red",

[NoCoverage] StringLiteral
app/(tabs)/profile.tsx:251:18
     marginTop: 20,
     backgroundColor: "white",
     borderWidth: 1,
-    borderColor: "red",
+    borderColor: "",
     padding: 12,
     borderRadius: 8,

[NoCoverage] StringLiteral
app/(tabs)/profile.tsx:254:17
     borderColor: "red",
     padding: 12,
     borderRadius: 8,
-    alignItems: "center",
+    alignItems: "",
   },
   logoutText: {

[NoCoverage] ObjectLiteral
app/(tabs)/profile.tsx:256:15
     borderRadius: 8,
     alignItems: "center",
   },
-  logoutText: {
-    color: "red",
-    fontWeight: "bold",
-  },
+  logoutText: {},
 });

[NoCoverage] StringLiteral
app/(tabs)/profile.tsx:258:17
   },
   logoutText: {
     color: "red",
-    fontWeight: "bold",
+    fontWeight: "",
   },
 });
