[Killed] StringLiteral
app/(tabs)/ReportScreen.tsx:21:44
   const [petStatus, setPetStatus] = useState<"lost" | "found">("lost");
   const [petName, setPetName] = useState("");
   const [lastSeenLocation, setLastSeenLocation] = useState("");
-  const [dateTime, setDateTime] = useState(""); // Display string
+  const [dateTime, setDateTime] = useState("Stryker was here!"); // Display string
   const [selectedDate, setSelectedDate] = useState(new Date());
   const [isDatePickerVisible, setDatePickerVisibility] = useState(false);
killedBy: ReportScreen (Lost/Found Pet Report) renders key components for lost pet report by default
statusReason: Error: Unable to find an element with text: Pick Date and Time

<View>
  <View>
    <View>
      <View
        accessible={true}
      >

[Survived] BooleanLiteral
app/(tabs)/ReportScreen.tsx:23:67
   const [lastSeenLocation, setLastSeenLocation] = useState("");
   const [dateTime, setDateTime] = useState(""); // Display string
   const [selectedDate, setSelectedDate] = useState(new Date());
-  const [isDatePickerVisible, setDatePickerVisibility] = useState(false);
+  const [isDatePickerVisible, setDatePickerVisibility] = useState(true);
   const [photoUri, setPhotoUri] = useState<string | null>(null);
   const [description, setDescription] = useState("");

[Survived] StringLiteral
app/(tabs)/ReportScreen.tsx:25:50
   const [selectedDate, setSelectedDate] = useState(new Date());
   const [isDatePickerVisible, setDatePickerVisibility] = useState(false);
   const [photoUri, setPhotoUri] = useState<string | null>(null);
-  const [description, setDescription] = useState("");
+  const [description, setDescription] = useState("Stryker was here!");
 
   // For both Lost and Found, we now use separate contact fields:

[Survived] StringLiteral
app/(tabs)/ReportScreen.tsx:29:52
 
   // For both Lost and Found, we now use separate contact fields:
   const [contactName, setContactName] = useState("");
-  const [contactPhone, setContactPhone] = useState("");
+  const [contactPhone, setContactPhone] = useState("Stryker was here!");
   const [contactEmail, setContactEmail] = useState("");
 

[Killed] BlockStatement
app/(tabs)/ReportScreen.tsx:38:41
   const router = useRouter();
 
   // Photo picking logic using Expo ImagePicker
-  const handlePhotoUpload = async () => {
-    try {
-      const { status } = await ImagePicker.requestMediaLibraryPermissionsAsync();
-      if (status !== "granted") {
-        Alert.alert(
-          "Permission Required",
-          "Camera roll permissions are needed to upload a photo."
-        );
-        return;
-      }
-
-      const result = await ImagePicker.launchImageLibraryAsync({
-        mediaTypes: ImagePicker.MediaTypeOptions.Images, // using deprecated API if necessary
-        allowsEditing: true,
-        aspect: [4, 3],
-        quality: 1,
-      });
-
-      if (!result.canceled) {
-        setPhotoUri(result.assets[0].uri);
-      }
-    } catch (error) {
-      Alert.alert("Error", "An error occurred while picking an image.");
-    }
-  };
+  const handlePhotoUpload = async () => {};
 
   // Simple function to remove the photo
killedBy: ReportScreen (Lost/Found Pet Report) handles image upload placeholder behavior
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
app/(tabs)/ReportScreen.tsx:39:9
 
   // Photo picking logic using Expo ImagePicker
   const handlePhotoUpload = async () => {
-    try {
-      const { status } = await ImagePicker.requestMediaLibraryPermissionsAsync();
-      if (status !== "granted") {
-        Alert.alert(
-          "Permission Required",
-          "Camera roll permissions are needed to upload a photo."
-        );
-        return;
-      }
-
-      const result = await ImagePicker.launchImageLibraryAsync({
-        mediaTypes: ImagePicker.MediaTypeOptions.Images, // using deprecated API if necessary
-        allowsEditing: true,
-        aspect: [4, 3],
-        quality: 1,
-      });
-
-      if (!result.canceled) {
-        setPhotoUri(result.assets[0].uri);
-      }
-    } catch (error) {
+    try {} catch (error) {
       Alert.alert("Error", "An error occurred while picking an image.");
     }
killedBy: ReportScreen (Lost/Found Pet Report) handles image upload placeholder behavior
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] EqualityOperator
app/(tabs)/ReportScreen.tsx:41:11
   const handlePhotoUpload = async () => {
     try {
       const { status } = await ImagePicker.requestMediaLibraryPermissionsAsync();
-      if (status !== "granted") {
+      if (status === "granted") {
         Alert.alert(
           "Permission Required",
killedBy: ReportScreen (Lost/Found Pet Report) handles image upload placeholder behavior
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
app/(tabs)/ReportScreen.tsx:41:11
   const handlePhotoUpload = async () => {
     try {
       const { status } = await ImagePicker.requestMediaLibraryPermissionsAsync();
-      if (status !== "granted") {
+      if (true) {
         Alert.alert(
           "Permission Required",
killedBy: ReportScreen (Lost/Found Pet Report) handles image upload placeholder behavior
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[NoCoverage] StringLiteral
app/(tabs)/ReportScreen.tsx:43:11
       const { status } = await ImagePicker.requestMediaLibraryPermissionsAsync();
       if (status !== "granted") {
         Alert.alert(
-          "Permission Required",
+          "",
           "Camera roll permissions are needed to upload a photo."
         );

[NoCoverage] StringLiteral
app/(tabs)/ReportScreen.tsx:44:11
       if (status !== "granted") {
         Alert.alert(
           "Permission Required",
-          "Camera roll permissions are needed to upload a photo."
+          ""
         );
         return;

[Survived] BooleanLiteral
app/(tabs)/ReportScreen.tsx:51:24
 
       const result = await ImagePicker.launchImageLibraryAsync({
         mediaTypes: ImagePicker.MediaTypeOptions.Images, // using deprecated API if necessary
-        allowsEditing: true,
+        allowsEditing: false,
         aspect: [4, 3],
         quality: 1,

[Survived] BlockStatement
app/(tabs)/ReportScreen.tsx:56:29
         quality: 1,
       });
 
-      if (!result.canceled) {
-        setPhotoUri(result.assets[0].uri);
-      }
+      if (!result.canceled) {}
     } catch (error) {
       Alert.alert("Error", "An error occurred while picking an image.");

[NoCoverage] BlockStatement
app/(tabs)/ReportScreen.tsx:59:21
       if (!result.canceled) {
         setPhotoUri(result.assets[0].uri);
       }
-    } catch (error) {
-      Alert.alert("Error", "An error occurred while picking an image.");
-    }
+    } catch (error) {}
   };
 

[NoCoverage] StringLiteral
app/(tabs)/ReportScreen.tsx:60:19
         setPhotoUri(result.assets[0].uri);
       }
     } catch (error) {
-      Alert.alert("Error", "An error occurred while picking an image.");
+      Alert.alert("", "An error occurred while picking an image.");
     }
   };

[NoCoverage] BlockStatement
app/(tabs)/ReportScreen.tsx:65:35
   };
 
   // Simple function to remove the photo
-  const handleRemovePhoto = () => {
-    setPhotoUri(null);
-  };
+  const handleRemovePhoto = () => {};
 
   const handleGoBackHome = () => {

[NoCoverage] BlockStatement
app/(tabs)/ReportScreen.tsx:69:34
     setPhotoUri(null);
   };
 
-  const handleGoBackHome = () => {
-    router.replace("HomeScreen");
-  };
+  const handleGoBackHome = () => {};
 
   const showDatePicker = () => {

[NoCoverage] BlockStatement
app/(tabs)/ReportScreen.tsx:73:32
     router.replace("HomeScreen");
   };
 
-  const showDatePicker = () => {
-    setDatePickerVisibility(true);
-  };
+  const showDatePicker = () => {};
 
   const hideDatePicker = () => {

[NoCoverage] BooleanLiteral
app/(tabs)/ReportScreen.tsx:74:29
   };
 
   const showDatePicker = () => {
-    setDatePickerVisibility(true);
+    setDatePickerVisibility(false);
   };
 

[NoCoverage] BlockStatement
app/(tabs)/ReportScreen.tsx:77:32
     setDatePickerVisibility(true);
   };
 
-  const hideDatePicker = () => {
-    setDatePickerVisibility(false);
-  };
+  const hideDatePicker = () => {};
 
   const handleConfirm = (date: Date) => {

[NoCoverage] BooleanLiteral
app/(tabs)/ReportScreen.tsx:78:29
   };
 
   const hideDatePicker = () => {
-    setDatePickerVisibility(false);
+    setDatePickerVisibility(true);
   };
 

[NoCoverage] BlockStatement
app/(tabs)/ReportScreen.tsx:81:41
     setDatePickerVisibility(false);
   };
 
-  const handleConfirm = (date: Date) => {
-    setSelectedDate(date);
-    setDateTime(date.toLocaleString());
-    hideDatePicker();
-  };
+  const handleConfirm = (date: Date) => {};
 
   const handleSubmit = () => {

[Survived] BooleanLiteral
app/(tabs)/ReportScreen.tsx:89:9
 
   const handleSubmit = () => {
     // Validate common fields
-    if (!lastSeenLocation) {
+    if (lastSeenLocation) {
       Alert.alert("Required Field Missing", "Please fill out the Last Seen Location.");
       return;

[Survived] ConditionalExpression
app/(tabs)/ReportScreen.tsx:89:9
 
   const handleSubmit = () => {
     // Validate common fields
-    if (!lastSeenLocation) {
+    if (true) {
       Alert.alert("Required Field Missing", "Please fill out the Last Seen Location.");
       return;

[Survived] StringLiteral
app/(tabs)/ReportScreen.tsx:90:45
   const handleSubmit = () => {
     // Validate common fields
     if (!lastSeenLocation) {
-      Alert.alert("Required Field Missing", "Please fill out the Last Seen Location.");
+      Alert.alert("Required Field Missing", "");
       return;
     }

[Survived] StringLiteral
app/(tabs)/ReportScreen.tsx:90:19
   const handleSubmit = () => {
     // Validate common fields
     if (!lastSeenLocation) {
-      Alert.alert("Required Field Missing", "Please fill out the Last Seen Location.");
+      Alert.alert("", "Please fill out the Last Seen Location.");
       return;
     }

[Survived] BooleanLiteral
app/(tabs)/ReportScreen.tsx:93:9
       Alert.alert("Required Field Missing", "Please fill out the Last Seen Location.");
       return;
     }
-    if (!dateTime) {
+    if (dateTime) {
       Alert.alert("Required Field Missing", "Please pick the Last Seen Date and Time.");
       return;

[Survived] BlockStatement
app/(tabs)/ReportScreen.tsx:93:20
       Alert.alert("Required Field Missing", "Please fill out the Last Seen Location.");
       return;
     }
-    if (!dateTime) {
-      Alert.alert("Required Field Missing", "Please pick the Last Seen Date and Time.");
-      return;
-    }
+    if (!dateTime) {}
     if (!contactName || !contactPhone || !contactEmail) {
       Alert.alert(

[NoCoverage] BooleanLiteral
app/(tabs)/ReportScreen.tsx:97:9
       Alert.alert("Required Field Missing", "Please pick the Last Seen Date and Time.");
       return;
     }
-    if (!contactName || !contactPhone || !contactEmail) {
+    if (contactName || !contactPhone || !contactEmail) {
       Alert.alert(
         "Required Field Missing",

[NoCoverage] ConditionalExpression
app/(tabs)/ReportScreen.tsx:97:9
       Alert.alert("Required Field Missing", "Please pick the Last Seen Date and Time.");
       return;
     }
-    if (!contactName || !contactPhone || !contactEmail) {
+    if (false) {
       Alert.alert(
         "Required Field Missing",

[NoCoverage] StringLiteral
app/(tabs)/ReportScreen.tsx:100:9
     if (!contactName || !contactPhone || !contactEmail) {
       Alert.alert(
         "Required Field Missing",
-        "Please fill out your Contact Information (Name, Phone, Email)."
+        ""
       );
       return;

[NoCoverage] ConditionalExpression
app/(tabs)/ReportScreen.tsx:105:9
       return;
     }
 
-    if (petStatus === "lost") {
+    if (false) {
       // Lost Pet validations
       if (!petName) {

[NoCoverage] EqualityOperator
app/(tabs)/ReportScreen.tsx:105:9
       return;
     }
 
-    if (petStatus === "lost") {
+    if (petStatus !== "lost") {
       // Lost Pet validations
       if (!petName) {

[NoCoverage] ConditionalExpression
app/(tabs)/ReportScreen.tsx:107:11
 
     if (petStatus === "lost") {
       // Lost Pet validations
-      if (!petName) {
+      if (false) {
         Alert.alert("Required Field Missing", "Please fill out the Pet Name.");
         return;

[NoCoverage] BlockStatement
app/(tabs)/ReportScreen.tsx:107:21
 
     if (petStatus === "lost") {
       // Lost Pet validations
-      if (!petName) {
-        Alert.alert("Required Field Missing", "Please fill out the Pet Name.");
-        return;
-      }
+      if (!petName) {}
       if (!description) {
         Alert.alert("Required Field Missing", "Please fill out the Description.");

[NoCoverage] StringLiteral
app/(tabs)/ReportScreen.tsx:108:21
     if (petStatus === "lost") {
       // Lost Pet validations
       if (!petName) {
-        Alert.alert("Required Field Missing", "Please fill out the Pet Name.");
+        Alert.alert("", "Please fill out the Pet Name.");
         return;
       }

[NoCoverage] BooleanLiteral
app/(tabs)/ReportScreen.tsx:111:11
         Alert.alert("Required Field Missing", "Please fill out the Pet Name.");
         return;
       }
-      if (!description) {
+      if (description) {
         Alert.alert("Required Field Missing", "Please fill out the Description.");
         return;

[NoCoverage] ConditionalExpression
app/(tabs)/ReportScreen.tsx:111:11
         Alert.alert("Required Field Missing", "Please fill out the Pet Name.");
         return;
       }
-      if (!description) {
+      if (true) {
         Alert.alert("Required Field Missing", "Please fill out the Description.");
         return;

[NoCoverage] StringLiteral
app/(tabs)/ReportScreen.tsx:112:21
         return;
       }
       if (!description) {
-        Alert.alert("Required Field Missing", "Please fill out the Description.");
+        Alert.alert("", "Please fill out the Description.");
         return;
       }

[NoCoverage] BlockStatement
app/(tabs)/ReportScreen.tsx:115:12
         Alert.alert("Required Field Missing", "Please fill out the Description.");
         return;
       }
-    } else {
-      // Found Pet validations
-      if (!petCondition) {
-        Alert.alert("Required Field Missing", "Please select the Pet Condition.");
-        return;
-      }
-    }
+    } else {}
 
     const formData = {

[NoCoverage] BooleanLiteral
app/(tabs)/ReportScreen.tsx:117:11
       }
     } else {
       // Found Pet validations
-      if (!petCondition) {
+      if (petCondition) {
         Alert.alert("Required Field Missing", "Please select the Pet Condition.");
         return;

[NoCoverage] BlockStatement
app/(tabs)/ReportScreen.tsx:117:26
       }
     } else {
       // Found Pet validations
-      if (!petCondition) {
-        Alert.alert("Required Field Missing", "Please select the Pet Condition.");
-        return;
-      }
+      if (!petCondition) {}
     }
 

[NoCoverage] StringLiteral
app/(tabs)/ReportScreen.tsx:118:21
     } else {
       // Found Pet validations
       if (!petCondition) {
-        Alert.alert("Required Field Missing", "Please select the Pet Condition.");
+        Alert.alert("", "Please select the Pet Condition.");
         return;
       }

[NoCoverage] ConditionalExpression
app/(tabs)/ReportScreen.tsx:130:21
       dateTime,
       photoUri,
       description,
-      petCondition: petStatus === "found" ? petCondition : null,
+      petCondition: false ? petCondition : null,
       contactName,
       contactPhone,

[NoCoverage] EqualityOperator
app/(tabs)/ReportScreen.tsx:130:21
       dateTime,
       photoUri,
       description,
-      petCondition: petStatus === "found" ? petCondition : null,
+      petCondition: petStatus !== "found" ? petCondition : null,
       contactName,
       contactPhone,

[NoCoverage] StringLiteral
app/(tabs)/ReportScreen.tsx:136:17
       contactEmail,
     };
 
-    console.log("Form Data:", formData);
+    console.log("", formData);
     Alert.alert("Submitted!", "Your report has been submitted.");
   };

[NoCoverage] BlockStatement
app/(tabs)/ReportScreen.tsx:141:59
   };
 
   // Simple function to show a tooltip Alert
-  const showTooltip = (title: string, message: string) => {
-    Alert.alert(title, message);
-  };
+  const showTooltip = (title: string, message: string) => {};
 
   return (

[Killed] ConditionalExpression
app/(tabs)/ReportScreen.tsx:173:14
         {/* Title */}
         <View style={styles.titleContainer}>
           <Text style={styles.titleText}>
-            {petStatus === "lost" ? "Report a Lost Pet" : "Report a Found/Stray Pet"}
+            {false ? "Report a Lost Pet" : "Report a Found/Stray Pet"}
           </Text>
         </View>
killedBy: ReportScreen (Lost/Found Pet Report) renders key components for lost pet report by default
statusReason: Error: Unable to find an element with text: Report a Lost Pet

<View>
  <View>
    <View>
      <View
        accessible={true}
      >

[Killed] EqualityOperator
app/(tabs)/ReportScreen.tsx:173:14
         {/* Title */}
         <View style={styles.titleContainer}>
           <Text style={styles.titleText}>
-            {petStatus === "lost" ? "Report a Lost Pet" : "Report a Found/Stray Pet"}
+            {petStatus !== "lost" ? "Report a Lost Pet" : "Report a Found/Stray Pet"}
           </Text>
         </View>
killedBy: ReportScreen (Lost/Found Pet Report) renders key components for lost pet report by default
statusReason: Error: Unable to find an element with text: Report a Lost Pet

<View>
  <View>
    <View>
      <View
        accessible={true}
      >

[Survived] ArrowFunction
app/(tabs)/ReportScreen.tsx:182:24
           <Text style={styles.boxLabel}>
             Pet Status (Required)
             <TouchableOpacity
-              onPress={() =>
-                showTooltip(
-                  "Pet Status",
-                  petStatus === "lost"
-                    ? "Must select 'Lost' for lost pet reports."
-                    : "Must select 'Found/Stray' for found pet reports."
-                )
+              onPress={() => undefined
               }
             >

[NoCoverage] StringLiteral
app/(tabs)/ReportScreen.tsx:184:19
             <TouchableOpacity
               onPress={() =>
                 showTooltip(
-                  "Pet Status",
+                  "",
                   petStatus === "lost"
                     ? "Must select 'Lost' for lost pet reports."

[NoCoverage] ConditionalExpression
app/(tabs)/ReportScreen.tsx:185:19
               onPress={() =>
                 showTooltip(
                   "Pet Status",
-                  petStatus === "lost"
+                  true
                     ? "Must select 'Lost' for lost pet reports."
                     : "Must select 'Found/Stray' for found pet reports."

[NoCoverage] ConditionalExpression
app/(tabs)/ReportScreen.tsx:185:19
               onPress={() =>
                 showTooltip(
                   "Pet Status",
-                  petStatus === "lost"
+                  false
                     ? "Must select 'Lost' for lost pet reports."
                     : "Must select 'Found/Stray' for found pet reports."

[NoCoverage] StringLiteral
app/(tabs)/ReportScreen.tsx:187:23
                   "Pet Status",
                   petStatus === "lost"
                     ? "Must select 'Lost' for lost pet reports."
-                    : "Must select 'Found/Stray' for found pet reports."
+                    : ""
                 )
               }

[Survived] ArrowFunction
app/(tabs)/ReportScreen.tsx:195:67
             </TouchableOpacity>
           </Text>
           <View style={styles.radioGroup}>
-            <TouchableOpacity style={styles.radioOption} onPress={() => setPetStatus("lost")}>
+            <TouchableOpacity style={styles.radioOption} onPress={() => undefined}>
               <View style={[styles.radioCircle, petStatus === "lost" && styles.selectedCircle]} />
               <Text style={styles.radioText}>Lost</Text>

[Survived] EqualityOperator
app/(tabs)/ReportScreen.tsx:196:49
           </Text>
           <View style={styles.radioGroup}>
             <TouchableOpacity style={styles.radioOption} onPress={() => setPetStatus("lost")}>
-              <View style={[styles.radioCircle, petStatus === "lost" && styles.selectedCircle]} />
+              <View style={[styles.radioCircle, petStatus !== "lost" && styles.selectedCircle]} />
               <Text style={styles.radioText}>Lost</Text>
             </TouchableOpacity>

[Survived] ConditionalExpression
app/(tabs)/ReportScreen.tsx:196:49
           </Text>
           <View style={styles.radioGroup}>
             <TouchableOpacity style={styles.radioOption} onPress={() => setPetStatus("lost")}>
-              <View style={[styles.radioCircle, petStatus === "lost" && styles.selectedCircle]} />
+              <View style={[styles.radioCircle, false]} />
               <Text style={styles.radioText}>Lost</Text>
             </TouchableOpacity>

[Survived] ArrowFunction
app/(tabs)/ReportScreen.tsx:199:67
               <View style={[styles.radioCircle, petStatus === "lost" && styles.selectedCircle]} />
               <Text style={styles.radioText}>Lost</Text>
             </TouchableOpacity>
-            <TouchableOpacity style={styles.radioOption} onPress={() => setPetStatus("found")}>
+            <TouchableOpacity style={styles.radioOption} onPress={() => undefined}>
               <View style={[styles.radioCircle, petStatus === "found" && styles.selectedCircle]} />
               <Text style={styles.radioText}>Found/Stray</Text>

[Survived] LogicalOperator
app/(tabs)/ReportScreen.tsx:200:49
               <Text style={styles.radioText}>Lost</Text>
             </TouchableOpacity>
             <TouchableOpacity style={styles.radioOption} onPress={() => setPetStatus("found")}>
-              <View style={[styles.radioCircle, petStatus === "found" && styles.selectedCircle]} />
+              <View style={[styles.radioCircle, petStatus === "found" || styles.selectedCircle]} />
               <Text style={styles.radioText}>Found/Stray</Text>
             </TouchableOpacity>

[Survived] ConditionalExpression
app/(tabs)/ReportScreen.tsx:200:49
               <Text style={styles.radioText}>Lost</Text>
             </TouchableOpacity>
             <TouchableOpacity style={styles.radioOption} onPress={() => setPetStatus("found")}>
-              <View style={[styles.radioCircle, petStatus === "found" && styles.selectedCircle]} />
+              <View style={[styles.radioCircle, false]} />
               <Text style={styles.radioText}>Found/Stray</Text>
             </TouchableOpacity>

[Survived] EqualityOperator
app/(tabs)/ReportScreen.tsx:209:14
         {/* Pet Name */}
         <View style={styles.boxContainer}>
           <Text style={styles.boxLabel}>
-            {petStatus === "lost" ? "Pet Name (Required)" : "Pet Name (Optional)"}
+            {petStatus !== "lost" ? "Pet Name (Required)" : "Pet Name (Optional)"}
             <TouchableOpacity
               onPress={() =>

[Survived] ConditionalExpression
app/(tabs)/ReportScreen.tsx:209:14
         {/* Pet Name */}
         <View style={styles.boxContainer}>
           <Text style={styles.boxLabel}>
-            {petStatus === "lost" ? "Pet Name (Required)" : "Pet Name (Optional)"}
+            {true ? "Pet Name (Required)" : "Pet Name (Optional)"}
             <TouchableOpacity
               onPress={() =>

[Survived] ArrowFunction
app/(tabs)/ReportScreen.tsx:211:24
           <Text style={styles.boxLabel}>
             {petStatus === "lost" ? "Pet Name (Required)" : "Pet Name (Optional)"}
             <TouchableOpacity
-              onPress={() =>
-                showTooltip(
-                  "Pet Name",
-                  petStatus === "lost"
-                    ? "Enter the name of the lost pet."
-                    : "If known, enter the name of the found pet."
-                )
+              onPress={() => undefined
               }
             >

[NoCoverage] EqualityOperator
app/(tabs)/ReportScreen.tsx:214:19
               onPress={() =>
                 showTooltip(
                   "Pet Name",
-                  petStatus === "lost"
+                  petStatus !== "lost"
                     ? "Enter the name of the lost pet."
                     : "If known, enter the name of the found pet."

[NoCoverage] ConditionalExpression
app/(tabs)/ReportScreen.tsx:214:19
               onPress={() =>
                 showTooltip(
                   "Pet Name",
-                  petStatus === "lost"
+                  true
                     ? "Enter the name of the lost pet."
                     : "If known, enter the name of the found pet."

[Survived] ArrowFunction
app/(tabs)/ReportScreen.tsx:237:24
           <Text style={styles.boxLabel}>
             Last Seen Location (Required)
             <TouchableOpacity
-              onPress={() =>
-                showTooltip(
-                  "Last Seen Location",
-                  petStatus === "lost"
-                    ? "Enter the nearest landmark, address, or GPS coordinates where the pet was last seen."
-                    : "Enter the location where the pet was found."
-                )
+              onPress={() => undefined
               }
             >

[NoCoverage] StringLiteral
app/(tabs)/ReportScreen.tsx:239:19
             <TouchableOpacity
               onPress={() =>
                 showTooltip(
-                  "Last Seen Location",
+                  "",
                   petStatus === "lost"
                     ? "Enter the nearest landmark, address, or GPS coordinates where the pet was last seen."

[NoCoverage] ConditionalExpression
app/(tabs)/ReportScreen.tsx:240:19
               onPress={() =>
                 showTooltip(
                   "Last Seen Location",
-                  petStatus === "lost"
+                  false
                     ? "Enter the nearest landmark, address, or GPS coordinates where the pet was last seen."
                     : "Enter the location where the pet was found."

[NoCoverage] EqualityOperator
app/(tabs)/ReportScreen.tsx:240:19
               onPress={() =>
                 showTooltip(
                   "Last Seen Location",
-                  petStatus === "lost"
+                  petStatus !== "lost"
                     ? "Enter the nearest landmark, address, or GPS coordinates where the pet was last seen."
                     : "Enter the location where the pet was found."

[Survived] ArrowFunction
app/(tabs)/ReportScreen.tsx:263:24
           <Text style={styles.boxLabel}>
             Last Seen Date and Time (Required)
             <TouchableOpacity
-              onPress={() =>
-                showTooltip(
-                  "Last Seen Date and Time",
-                  "Select the exact or approximate date and time the pet was last seen or found."
-                )
+              onPress={() => undefined
               }
             >

[NoCoverage] StringLiteral
app/(tabs)/ReportScreen.tsx:265:19
             <TouchableOpacity
               onPress={() =>
                 showTooltip(
-                  "Last Seen Date and Time",
+                  "",
                   "Select the exact or approximate date and time the pet was last seen or found."
                 )

[Survived] ArrowFunction
app/(tabs)/ReportScreen.tsx:291:24
           <Text style={styles.boxLabel}>
             Photo of the Pet (Optional)
             <TouchableOpacity
-              onPress={() =>
-                showTooltip(
-                  "Photo",
-                  "Select a clear image of the pet for identification purposes."
-                )
+              onPress={() => undefined
               }
             >

[Survived] ConditionalExpression
app/(tabs)/ReportScreen.tsx:304:12
           <TouchableOpacity style={styles.addPhotoButton} onPress={handlePhotoUpload}>
             <Text style={styles.addPhotoButtonText}>Add Photo</Text>
           </TouchableOpacity>
-          {photoUri && (
-            <>
-              <Image
-                source={{ uri: photoUri }}
-                style={{ width: 200, height: 200, marginTop: 10 }}
-              />
-              <TouchableOpacity style={styles.removePhotoButton} onPress={handleRemovePhoto}>
-                <Text style={styles.removePhotoButtonText}>Remove Photo</Text>
-              </TouchableOpacity>
-            </>
-          )}
+          {false}
         </View>
 

[Survived] ConditionalExpression
app/(tabs)/ReportScreen.tsx:304:12
           <TouchableOpacity style={styles.addPhotoButton} onPress={handlePhotoUpload}>
             <Text style={styles.addPhotoButtonText}>Add Photo</Text>
           </TouchableOpacity>
-          {photoUri && (
-            <>
-              <Image
-                source={{ uri: photoUri }}
-                style={{ width: 200, height: 200, marginTop: 10 }}
-              />
-              <TouchableOpacity style={styles.removePhotoButton} onPress={handleRemovePhoto}>
-                <Text style={styles.removePhotoButtonText}>Remove Photo</Text>
-              </TouchableOpacity>
-            </>
-          )}
+          {true}
         </View>
 

[Survived] ObjectLiteral
app/(tabs)/ReportScreen.tsx:307:25
           {photoUri && (
             <>
               <Image
-                source={{ uri: photoUri }}
+                source={{}}
                 style={{ width: 200, height: 200, marginTop: 10 }}
               />
