[Survived] ObjectLiteral
app/(tabs)/ReportScreen.tsx:308:24
             <>
               <Image
                 source={{ uri: photoUri }}
-                style={{ width: 200, height: 200, marginTop: 10 }}
+                style={{}}
               />
               <TouchableOpacity style={styles.removePhotoButton} onPress={handleRemovePhoto}>

[Survived] EqualityOperator
app/(tabs)/ReportScreen.tsx:320:14
         {/* Description */}
         <View style={styles.boxContainer}>
           <Text style={styles.boxLabel}>
-            {petStatus === "lost" ? "Description (Required)" : "Description (Optional)"}
+            {petStatus !== "lost" ? "Description (Required)" : "Description (Optional)"}
             <TouchableOpacity
               onPress={() =>

[Survived] ConditionalExpression
app/(tabs)/ReportScreen.tsx:320:14
         {/* Description */}
         <View style={styles.boxContainer}>
           <Text style={styles.boxLabel}>
-            {petStatus === "lost" ? "Description (Required)" : "Description (Optional)"}
+            {true ? "Description (Required)" : "Description (Optional)"}
             <TouchableOpacity
               onPress={() =>

[Survived] ArrowFunction
app/(tabs)/ReportScreen.tsx:322:24
           <Text style={styles.boxLabel}>
             {petStatus === "lost" ? "Description (Required)" : "Description (Optional)"}
             <TouchableOpacity
-              onPress={() =>
-                showTooltip(
-                  "Description",
-                  petStatus === "lost"
-                    ? "Provide details such as breed, color, size, and any distinguishing marks."
-                    : "Optionally provide details like breed, color, size, and distinguishing marks."
-                )
+              onPress={() => undefined
               }
             >

[NoCoverage] StringLiteral
app/(tabs)/ReportScreen.tsx:324:19
             <TouchableOpacity
               onPress={() =>
                 showTooltip(
-                  "Description",
+                  "",
                   petStatus === "lost"
                     ? "Provide details such as breed, color, size, and any distinguishing marks."

[NoCoverage] ConditionalExpression
app/(tabs)/ReportScreen.tsx:325:19
               onPress={() =>
                 showTooltip(
                   "Description",
-                  petStatus === "lost"
+                  false
                     ? "Provide details such as breed, color, size, and any distinguishing marks."
                     : "Optionally provide details like breed, color, size, and distinguishing marks."

[NoCoverage] ConditionalExpression
app/(tabs)/ReportScreen.tsx:325:19
               onPress={() =>
                 showTooltip(
                   "Description",
-                  petStatus === "lost"
+                  true
                     ? "Provide details such as breed, color, size, and any distinguishing marks."
                     : "Optionally provide details like breed, color, size, and distinguishing marks."

[NoCoverage] StringLiteral
app/(tabs)/ReportScreen.tsx:326:23
                 showTooltip(
                   "Description",
                   petStatus === "lost"
-                    ? "Provide details such as breed, color, size, and any distinguishing marks."
+                    ? ""
                     : "Optionally provide details like breed, color, size, and distinguishing marks."
                 )

[Survived] ArrayDeclaration
app/(tabs)/ReportScreen.tsx:335:20
             </TouchableOpacity>
           </Text>
           <TextInput
-            style={[styles.boxInput, { height: 80 }]}
+            style={[]}
             placeholder="Enter description"
             placeholderTextColor="#A9A9AC"

[Survived] ConditionalExpression
app/(tabs)/ReportScreen.tsx:345:10
         </View>
 
         {/* Additional Fields for Found Reports */}
-        {petStatus === "found" && (
+        {true && (
           <View style={styles.boxContainer}>
             <Text style={styles.boxLabel}>

[Survived] EqualityOperator
app/(tabs)/ReportScreen.tsx:345:10
         </View>
 
         {/* Additional Fields for Found Reports */}
-        {petStatus === "found" && (
+        {petStatus !== "found" && (
           <View style={styles.boxContainer}>
             <Text style={styles.boxLabel}>

[NoCoverage] ArrowFunction
app/(tabs)/ReportScreen.tsx:350:26
             <Text style={styles.boxLabel}>
               Pet Condition (Required)
               <TouchableOpacity
-                onPress={() =>
-                  showTooltip(
-                    "Pet Condition",
-                    "Select one: In my custody, Roaming, or Deceased."
-                  )
+                onPress={() => undefined
                 }
               >

[NoCoverage] StringLiteral
app/(tabs)/ReportScreen.tsx:352:21
               <TouchableOpacity
                 onPress={() =>
                   showTooltip(
-                    "Pet Condition",
+                    "",
                     "Select one: In my custody, Roaming, or Deceased."
                   )

[NoCoverage] ArrowFunction
app/(tabs)/ReportScreen.tsx:363:26
             <View style={styles.radioGroup}>
               <TouchableOpacity
                 style={styles.radioOption}
-                onPress={() => setPetCondition("in my custody")}
+                onPress={() => undefined}
               >
                 <View

[NoCoverage] ArrayDeclaration
app/(tabs)/ReportScreen.tsx:366:26
                 onPress={() => setPetCondition("in my custody")}
               >
                 <View
-                  style={[
-                    styles.radioCircle,
-                    petCondition === "in my custody" && styles.selectedCircle,
-                  ]}
+                  style={[]}
                 />
                 <Text style={styles.radioText}>In my custody</Text>

[NoCoverage] LogicalOperator
app/(tabs)/ReportScreen.tsx:368:21
                 <View
                   style={[
                     styles.radioCircle,
-                    petCondition === "in my custody" && styles.selectedCircle,
+                    petCondition === "in my custody" || styles.selectedCircle,
                   ]}
                 />

[NoCoverage] EqualityOperator
app/(tabs)/ReportScreen.tsx:368:21
                 <View
                   style={[
                     styles.radioCircle,
-                    petCondition === "in my custody" && styles.selectedCircle,
+                    petCondition !== "in my custody" && styles.selectedCircle,
                   ]}
                 />

[NoCoverage] ArrowFunction
app/(tabs)/ReportScreen.tsx:375:26
               </TouchableOpacity>
               <TouchableOpacity
                 style={styles.radioOption}
-                onPress={() => setPetCondition("roaming")}
+                onPress={() => undefined}
               >
                 <View

[NoCoverage] LogicalOperator
app/(tabs)/ReportScreen.tsx:380:21
                 <View
                   style={[
                     styles.radioCircle,
-                    petCondition === "roaming" && styles.selectedCircle,
+                    petCondition === "roaming" || styles.selectedCircle,
                   ]}
                 />

[NoCoverage] ConditionalExpression
app/(tabs)/ReportScreen.tsx:380:21
                 <View
                   style={[
                     styles.radioCircle,
-                    petCondition === "roaming" && styles.selectedCircle,
+                    true,
                   ]}
                 />

[NoCoverage] ArrowFunction
app/(tabs)/ReportScreen.tsx:387:26
               </TouchableOpacity>
               <TouchableOpacity
                 style={styles.radioOption}
-                onPress={() => setPetCondition("deceased")}
+                onPress={() => undefined}
               >
                 <View

[NoCoverage] ArrayDeclaration
app/(tabs)/ReportScreen.tsx:390:26
                 onPress={() => setPetCondition("deceased")}
               >
                 <View
-                  style={[
-                    styles.radioCircle,
-                    petCondition === "deceased" && styles.selectedCircle,
-                  ]}
+                  style={[]}
                 />
                 <Text style={styles.radioText}>Deceased</Text>

[NoCoverage] LogicalOperator
app/(tabs)/ReportScreen.tsx:392:21
                 <View
                   style={[
                     styles.radioCircle,
-                    petCondition === "deceased" && styles.selectedCircle,
+                    petCondition === "deceased" || styles.selectedCircle,
                   ]}
                 />

[NoCoverage] ConditionalExpression
app/(tabs)/ReportScreen.tsx:392:21
                 <View
                   style={[
                     styles.radioCircle,
-                    petCondition === "deceased" && styles.selectedCircle,
+                    false,
                   ]}
                 />

[Survived] ArrowFunction
app/(tabs)/ReportScreen.tsx:406:24
           <Text style={styles.boxLabel}>
             Contact Information (Required)
             <TouchableOpacity
-              onPress={() =>
-                showTooltip(
-                  "Contact Information",
-                  petStatus === "lost"
-                    ? "Enter your name, phone number, and email as the submitter."
-                    : "Enter the finder’s name, phone number, and email."
-                )
+              onPress={() => undefined
               }
             >

[NoCoverage] ConditionalExpression
app/(tabs)/ReportScreen.tsx:409:19
               onPress={() =>
                 showTooltip(
                   "Contact Information",
-                  petStatus === "lost"
+                  false
                     ? "Enter your name, phone number, and email as the submitter."
                     : "Enter the finder’s name, phone number, and email."

[NoCoverage] EqualityOperator
app/(tabs)/ReportScreen.tsx:409:19
               onPress={() =>
                 showTooltip(
                   "Contact Information",
-                  petStatus === "lost"
+                  petStatus !== "lost"
                     ? "Enter your name, phone number, and email as the submitter."
                     : "Enter the finder’s name, phone number, and email."

[Survived] ObjectLiteral
app/(tabs)/ReportScreen.tsx:449:22
           <Text style={styles.submitButtonText}>Submit</Text>
         </TouchableOpacity>
 
-        <View style={{ height: 30 }} />
+        <View style={{}} />
       </ScrollView>
     </View>

[Survived] StringLiteral
app/(tabs)/ReportScreen.tsx:459:22
 const styles = StyleSheet.create({
   screenContainer: {
     flex: 1,
-    backgroundColor: "#FBF0DC",
+    backgroundColor: "",
   },
   header: {

[Survived] ObjectLiteral
app/(tabs)/ReportScreen.tsx:461:11
     flex: 1,
     backgroundColor: "#FBF0DC",
   },
-  header: {
-    height: "25%",
-    width: "100%",
-    backgroundColor: "#FBF0DC",
-    paddingTop: 50,
-    paddingHorizontal: 15,
-    alignItems: "center",
-    justifyContent: "center",
-  },
+  header: {},
   headerTopRow: {
     flexDirection: "row",

[Survived] StringLiteral
app/(tabs)/ReportScreen.tsx:463:12
   },
   header: {
     height: "25%",
-    width: "100%",
+    width: "",
     backgroundColor: "#FBF0DC",
     paddingTop: 50,

[Survived] StringLiteral
app/(tabs)/ReportScreen.tsx:464:22
   header: {
     height: "25%",
     width: "100%",
-    backgroundColor: "#FBF0DC",
+    backgroundColor: "",
     paddingTop: 50,
     paddingHorizontal: 15,

[Survived] StringLiteral
app/(tabs)/ReportScreen.tsx:473:12
   headerTopRow: {
     flexDirection: "row",
     justifyContent: "space-between",
-    width: "100%",
+    width: "",
     alignItems: "center",
   },

[Survived] StringLiteral
app/(tabs)/ReportScreen.tsx:487:17
   headerImage: {
     width: 75,
     height: 75,
-    resizeMode: "contain",
+    resizeMode: "",
   },
   alarmContainer: {

[Survived] StringLiteral
app/(tabs)/ReportScreen.tsx:492:21
   alarmContainer: {
     marginBottom: 50,
     alignItems: "center",
-    justifyContent: "center",
+    justifyContent: "",
   },
   alarmImage: {

[Killed] ObjectLiteral
app/(tabs)/ReportScreen.tsx:494:15
     alignItems: "center",
     justifyContent: "center",
   },
-  alarmImage: {
-    width: 100,
-    height: 100,
-    resizeMode: "contain",
-  },
+  alarmImage: {},
   scrollView: {
     flex: 1,
killedBy: Performance Tests for ReportScreen renders the ReportScreen quickly
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 500
Received:   503

[Survived] StringLiteral
app/(tabs)/ReportScreen.tsx:497:17
   alarmImage: {
     width: 100,
     height: 100,
-    resizeMode: "contain",
+    resizeMode: "",
   },
   scrollView: {

[Survived] ObjectLiteral
app/(tabs)/ReportScreen.tsx:502:18
   scrollView: {
     flex: 1,
   },
-  scrollContent: {
-    paddingHorizontal: 20,
-    paddingTop: 20,
-  },
+  scrollContent: {},
   titleContainer: {
     alignItems: "center",

[Survived] StringLiteral
app/(tabs)/ReportScreen.tsx:507:17
     paddingTop: 20,
   },
   titleContainer: {
-    alignItems: "center",
+    alignItems: "",
     marginBottom: 20,
   },

[Survived] ObjectLiteral
app/(tabs)/ReportScreen.tsx:510:14
     alignItems: "center",
     marginBottom: 20,
   },
-  titleText: {
-    fontSize: 20,
-    color: "#6B431F",
-    textAlign: "center",
-    fontWeight: "600",
-  },
+  titleText: {},
   boxContainer: {
     borderWidth: 1,

[Survived] StringLiteral
app/(tabs)/ReportScreen.tsx:512:12
   },
   titleText: {
     fontSize: 20,
-    color: "#6B431F",
+    color: "",
     textAlign: "center",
     fontWeight: "600",

[Survived] StringLiteral
app/(tabs)/ReportScreen.tsx:513:16
   titleText: {
     fontSize: 20,
     color: "#6B431F",
-    textAlign: "center",
+    textAlign: "",
     fontWeight: "600",
   },

[Survived] StringLiteral
app/(tabs)/ReportScreen.tsx:522:22
     borderRadius: 5,
     padding: 10,
     marginBottom: 15,
-    backgroundColor: "#fff",
+    backgroundColor: "",
   },
   boxLabel: {

[Survived] ObjectLiteral
app/(tabs)/ReportScreen.tsx:524:13
     marginBottom: 15,
     backgroundColor: "#fff",
   },
-  boxLabel: {
-    fontSize: 16,
-    fontWeight: "bold",
-    color: "#6B431F",
-    marginBottom: 5,
-  },
+  boxLabel: {},
   infoIcon: {
     color: "#6B431F",

[Survived] ObjectLiteral
app/(tabs)/ReportScreen.tsx:541:15
     paddingHorizontal: 5,
     paddingVertical: 4,
   },
-  dateButton: {
-    paddingVertical: 10,
-    paddingHorizontal: 15,
-    borderWidth: 1,
-    borderColor: "#6B431F",
-    borderRadius: 5,
-    backgroundColor: "#FBF0DC",
-    alignItems: "center",
-  },
+  dateButton: {},
   dateButtonText: {
     fontSize: 16,

[Survived] StringLiteral
app/(tabs)/ReportScreen.tsx:555:20
     color: "#6B431F",
   },
   radioGroup: {
-    flexDirection: "row",
+    flexDirection: "",
     marginTop: 5,
   },

[Survived] ObjectLiteral
app/(tabs)/ReportScreen.tsx:563:16
     alignItems: "center",
     marginRight: 20,
   },
-  radioCircle: {
-    width: 20,
-    height: 20,
-    borderRadius: 10,
-    borderWidth: 2,
-    borderColor: "#6B431F",
-    marginRight: 5,
-    alignItems: "center",
-    justifyContent: "center",
-  },
+  radioCircle: {},
   selectedCircle: {
     backgroundColor: "#6B431F",

[Survived] StringLiteral
app/(tabs)/ReportScreen.tsx:570:17
     borderWidth: 2,
     borderColor: "#6B431F",
     marginRight: 5,
-    alignItems: "center",
+    alignItems: "",
     justifyContent: "center",
   },

[Survived] StringLiteral
app/(tabs)/ReportScreen.tsx:574:22
     justifyContent: "center",
   },
   selectedCircle: {
-    backgroundColor: "#6B431F",
+    backgroundColor: "",
   },
   radioText: {

[Survived] ObjectLiteral
app/(tabs)/ReportScreen.tsx:580:19
     fontSize: 14,
     color: "#6B431F",
   },
-  addPhotoButton: {
-    backgroundColor: "#FBF0DC",
-    borderWidth: 1,
-    borderColor: "#6B431F",
-    borderRadius: 5,
-    paddingVertical: 10,
-    paddingHorizontal: 15,
-    alignItems: "center",
-    marginTop: 5,
-  },
+  addPhotoButton: {},
   addPhotoButtonText: {
     color: "#6B431F",

[Survived] StringLiteral
app/(tabs)/ReportScreen.tsx:591:12
     marginTop: 5,
   },
   addPhotoButtonText: {
-    color: "#6B431F",
+    color: "",
     fontWeight: "bold",
     fontSize: 14,

[Survived] StringLiteral
app/(tabs)/ReportScreen.tsx:598:18
   removePhotoButton: {
     backgroundColor: "#fff",
     borderWidth: 1,
-    borderColor: "#6B431F",
+    borderColor: "",
     borderRadius: 5,
     paddingVertical: 5,

[Survived] StringLiteral
app/(tabs)/ReportScreen.tsx:610:22
     fontSize: 14,
   },
   submitButton: {
-    backgroundColor: "#6B431F",
+    backgroundColor: "",
     borderRadius: 5,
     paddingVertical: 15,

[Survived] StringLiteral
app/(tabs)/ReportScreen.tsx:613:17
     backgroundColor: "#6B431F",
     borderRadius: 5,
     paddingVertical: 15,
-    alignItems: "center",
+    alignItems: "",
     marginTop: 10,
   },

[Survived] StringLiteral
app/(tabs)/ReportScreen.tsx:619:17
   submitButtonText: {
     color: "#fff",
     fontSize: 18,
-    fontWeight: "bold",
+    fontWeight: "",
   },
 });
