[NoCoverage] ObjectLiteral
app/(tabs)/SignUp.tsx:22:14
 const { width } = Dimensions.get('window');
 
 const styles = StyleSheet.create({
-  container: {
-    flex: 1,
-    padding: 20,
-    justifyContent: 'center',
-    backgroundColor: '#ffffff',
-  },
+  container: {},
   title: {
     fontSize: 24,

[NoCoverage] StringLiteral
app/(tabs)/SignUp.tsx:26:22
     flex: 1,
     padding: 20,
     justifyContent: 'center',
-    backgroundColor: '#ffffff',
+    backgroundColor: "",
   },
   title: {

[NoCoverage] ObjectLiteral
app/(tabs)/SignUp.tsx:28:10
     justifyContent: 'center',
     backgroundColor: '#ffffff',
   },
-  title: {
-    fontSize: 24,
-    fontWeight: 'bold',
-    color: '#333333',
-    marginBottom: 10,
-  },
+  title: {},
   subtitle: {
     fontSize: 16,

[NoCoverage] StringLiteral
app/(tabs)/SignUp.tsx:31:12
   title: {
     fontSize: 24,
     fontWeight: 'bold',
-    color: '#333333',
+    color: "",
     marginBottom: 10,
   },

[NoCoverage] ObjectLiteral
app/(tabs)/SignUp.tsx:34:13
     color: '#333333',
     marginBottom: 10,
   },
-  subtitle: {
-    fontSize: 16,
-    color: '#666666',
-    marginBottom: 20,
-  },
+  subtitle: {},
   inputContainer: {
     marginBottom: 15,

[NoCoverage] StringLiteral
app/(tabs)/SignUp.tsx:36:12
   },
   subtitle: {
     fontSize: 16,
-    color: '#666666',
+    color: "",
     marginBottom: 20,
   },

[NoCoverage] StringLiteral
app/(tabs)/SignUp.tsx:44:17
   },
   label: {
     fontSize: 14,
-    fontWeight: 'bold',
+    fontWeight: "",
     color: '#333333',
     marginBottom: 5,

[NoCoverage] ObjectLiteral
app/(tabs)/SignUp.tsx:48:10
     color: '#333333',
     marginBottom: 5,
   },
-  input: {
-    height: 50,
-    borderColor: '#cccccc',
-    borderWidth: 1,
-    borderRadius: 8,
-    paddingHorizontal: 10,
-    fontSize: 16,
-    color: '#333333',
-    justifyContent: 'center',
-  },
+  input: {},
   errorText: {
     color: 'red',

[NoCoverage] StringLiteral
app/(tabs)/SignUp.tsx:50:18
   },
   input: {
     height: 50,
-    borderColor: '#cccccc',
+    borderColor: "",
     borderWidth: 1,
     borderRadius: 8,

[NoCoverage] ObjectLiteral
app/(tabs)/SignUp.tsx:63:11
     fontSize: 14,
     marginTop: 5,
   },
-  button: {
-    backgroundColor: '#16A849',
-    padding: 15,
-    borderRadius: 8,
-    alignItems: 'center',
-    marginTop: 20,
-  },
+  button: {},
   buttonText: {
     color: '#ffffff',

[NoCoverage] StringLiteral
app/(tabs)/SignUp.tsx:71:12
     marginTop: 20,
   },
   buttonText: {
-    color: '#ffffff',
+    color: "",
     fontSize: 16,
     fontWeight: 'bold',

[NoCoverage] StringLiteral
app/(tabs)/SignUp.tsx:79:17
     backgroundColor: '#ffffff',
     padding: 15,
     borderRadius: 8,
-    alignItems: 'center',
+    alignItems: "",
     marginTop: 10,
     borderWidth: 1,

[NoCoverage] StringLiteral
app/(tabs)/SignUp.tsx:97:44
 });
 
 const SignUpForm: React.FC = () => {
-  const [fullName, setFullName] = useState('');
+  const [fullName, setFullName] = useState("Stryker was here!");
   const [email, setEmail] = useState('');
   const [dateOfBirth, setDateOfBirth] = useState('');

[NoCoverage] StringLiteral
app/(tabs)/SignUp.tsx:100:50
   const [fullName, setFullName] = useState('');
   const [email, setEmail] = useState('');
   const [dateOfBirth, setDateOfBirth] = useState('');
-  const [phoneNumber, setPhoneNumber] = useState('');
+  const [phoneNumber, setPhoneNumber] = useState("Stryker was here!");
   const [password, setPassword] = useState('');
   const [loading, setLoading] = useState(false);

[NoCoverage] BooleanLiteral
app/(tabs)/SignUp.tsx:102:42
   const [dateOfBirth, setDateOfBirth] = useState('');
   const [phoneNumber, setPhoneNumber] = useState('');
   const [password, setPassword] = useState('');
-  const [loading, setLoading] = useState(false);
+  const [loading, setLoading] = useState(true);
   const [errorMessages, setErrorMessages] = useState<{ [key: string]: string }>({});
   const [showDatePicker, setShowDatePicker] = useState(false);

[NoCoverage] BooleanLiteral
app/(tabs)/SignUp.tsx:104:56
   const [password, setPassword] = useState('');
   const [loading, setLoading] = useState(false);
   const [errorMessages, setErrorMessages] = useState<{ [key: string]: string }>({});
-  const [showDatePicker, setShowDatePicker] = useState(false);
+  const [showDatePicker, setShowDatePicker] = useState(true);
   const router = useRouter();
 

[NoCoverage] StringLiteral
app/(tabs)/SignUp.tsx:109:15
 
   // Google OAuth
   const [request, response, promptAsync] = Google.useAuthRequest({
-    clientId: 'YOUR_GOOGLE_EXPO_CLIENT_ID', // Replace with your Google Expo client ID
+    clientId: "", // Replace with your Google Expo client ID
     iosClientId: 'YOUR_GOOGLE_IOS_CLIENT_ID', // Replace with your Google iOS client ID
     androidClientId: 'YOUR_GOOGLE_ANDROID_CLIENT_ID', // Replace with your Google Android client ID

[NoCoverage] StringLiteral
app/(tabs)/SignUp.tsx:117:15
 
   // Facebook OAuth
   const [fbRequest, fbResponse, fbPromptAsync] = Facebook.useAuthRequest({
-    clientId: 'YOUR_FACEBOOK_APP_ID', // Replace with your Facebook App ID
+    clientId: "", // Replace with your Facebook App ID
   });
 

[NoCoverage] BlockStatement
app/(tabs)/SignUp.tsx:121:25
   });
 
   // Handle Google OAuth response
-  React.useEffect(() => {
-    if (response?.type === 'success') {
-      const { authentication } = response;
-      if (authentication?.accessToken) {
-        handleSocialSignIn('google', authentication.accessToken);
-      }
-    }
-  }, [response]);
+  React.useEffect(() => {}, [response]);
 
   // Handle Facebook OAuth response

[NoCoverage] EqualityOperator
app/(tabs)/SignUp.tsx:122:9
 
   // Handle Google OAuth response
   React.useEffect(() => {
-    if (response?.type === 'success') {
+    if (response?.type !== 'success') {
       const { authentication } = response;
       if (authentication?.accessToken) {

[NoCoverage] BlockStatement
app/(tabs)/SignUp.tsx:122:39
 
   // Handle Google OAuth response
   React.useEffect(() => {
-    if (response?.type === 'success') {
-      const { authentication } = response;
-      if (authentication?.accessToken) {
-        handleSocialSignIn('google', authentication.accessToken);
-      }
-    }
+    if (response?.type === 'success') {}
   }, [response]);
 

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:124:11
   React.useEffect(() => {
     if (response?.type === 'success') {
       const { authentication } = response;
-      if (authentication?.accessToken) {
+      if (true) {
         handleSocialSignIn('google', authentication.accessToken);
       }

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:124:11
   React.useEffect(() => {
     if (response?.type === 'success') {
       const { authentication } = response;
-      if (authentication?.accessToken) {
+      if (false) {
         handleSocialSignIn('google', authentication.accessToken);
       }

[NoCoverage] ArrayDeclaration
app/(tabs)/SignUp.tsx:128:6
         handleSocialSignIn('google', authentication.accessToken);
       }
     }
-  }, [response]);
+  }, []);
 
   // Handle Facebook OAuth response

[NoCoverage] BlockStatement
app/(tabs)/SignUp.tsx:131:25
   }, [response]);
 
   // Handle Facebook OAuth response
-  React.useEffect(() => {
-    if (fbResponse?.type === 'success') {
-      const { authentication } = fbResponse;
-      if (authentication?.accessToken) {
-        handleSocialSignIn('facebook', authentication.accessToken);
-      }
-    }
-  }, [fbResponse]);
+  React.useEffect(() => {}, [fbResponse]);
 
   // Handle social sign-in with Supabase

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:132:9
 
   // Handle Facebook OAuth response
   React.useEffect(() => {
-    if (fbResponse?.type === 'success') {
+    if (false) {
       const { authentication } = fbResponse;
       if (authentication?.accessToken) {

[NoCoverage] EqualityOperator
app/(tabs)/SignUp.tsx:132:9
 
   // Handle Facebook OAuth response
   React.useEffect(() => {
-    if (fbResponse?.type === 'success') {
+    if (fbResponse?.type !== 'success') {
       const { authentication } = fbResponse;
       if (authentication?.accessToken) {

[NoCoverage] OptionalChaining
app/(tabs)/SignUp.tsx:134:11
   React.useEffect(() => {
     if (fbResponse?.type === 'success') {
       const { authentication } = fbResponse;
-      if (authentication?.accessToken) {
+      if (authentication.accessToken) {
         handleSocialSignIn('facebook', authentication.accessToken);
       }

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:134:11
   React.useEffect(() => {
     if (fbResponse?.type === 'success') {
       const { authentication } = fbResponse;
-      if (authentication?.accessToken) {
+      if (true) {
         handleSocialSignIn('facebook', authentication.accessToken);
       }

[NoCoverage] BlockStatement
app/(tabs)/SignUp.tsx:141:94
   }, [fbResponse]);
 
   // Handle social sign-in with Supabase
-  const handleSocialSignIn = async (provider: 'google' | 'facebook', accessToken: string) => {
-    setLoading(true);
-    try {
-      const { data, error } = await supabase.auth.signInWithOAuth({
-        provider,
-        options: {
-          redirectTo: 'myapp://auth-callback', // Replace with your app's redirect URL
-        },
-      });
-
-      if (error) {
-        setErrorMessages({ general: error.message });
-        setLoading(false);
-        return;
-      }
-
-      setErrorMessages({});
-      router.replace('/LoginScreen');
-    } catch (err) {
-      setErrorMessages({ general: 'An unexpected error occurred. Try again.' });
-    } finally {
-      setLoading(false);
-    }
-  };
+  const handleSocialSignIn = async (provider: 'google' | 'facebook', accessToken: string) => {};
 
   const validateInputs = () => {

[NoCoverage] BooleanLiteral
app/(tabs)/SignUp.tsx:142:16
 
   // Handle social sign-in with Supabase
   const handleSocialSignIn = async (provider: 'google' | 'facebook', accessToken: string) => {
-    setLoading(true);
+    setLoading(false);
     try {
       const { data, error } = await supabase.auth.signInWithOAuth({

[NoCoverage] BlockStatement
app/(tabs)/SignUp.tsx:143:9
   // Handle social sign-in with Supabase
   const handleSocialSignIn = async (provider: 'google' | 'facebook', accessToken: string) => {
     setLoading(true);
-    try {
-      const { data, error } = await supabase.auth.signInWithOAuth({
-        provider,
-        options: {
-          redirectTo: 'myapp://auth-callback', // Replace with your app's redirect URL
-        },
-      });
-
-      if (error) {
-        setErrorMessages({ general: error.message });
-        setLoading(false);
-        return;
-      }
-
-      setErrorMessages({});
-      router.replace('/LoginScreen');
-    } catch (err) {
+    try {} catch (err) {
       setErrorMessages({ general: 'An unexpected error occurred. Try again.' });
     } finally {

[NoCoverage] ObjectLiteral
app/(tabs)/SignUp.tsx:144:67
   const handleSocialSignIn = async (provider: 'google' | 'facebook', accessToken: string) => {
     setLoading(true);
     try {
-      const { data, error } = await supabase.auth.signInWithOAuth({
-        provider,
-        options: {
-          redirectTo: 'myapp://auth-callback', // Replace with your app's redirect URL
-        },
-      });
+      const { data, error } = await supabase.auth.signInWithOAuth({});
 
       if (error) {

[NoCoverage] BlockStatement
app/(tabs)/SignUp.tsx:151:18
         },
       });
 
-      if (error) {
-        setErrorMessages({ general: error.message });
-        setLoading(false);
-        return;
-      }
+      if (error) {}
 
       setErrorMessages({});

[NoCoverage] BooleanLiteral
app/(tabs)/SignUp.tsx:153:20
 
       if (error) {
         setErrorMessages({ general: error.message });
-        setLoading(false);
+        setLoading(true);
         return;
       }

[NoCoverage] StringLiteral
app/(tabs)/SignUp.tsx:158:22
       }
 
       setErrorMessages({});
-      router.replace('/LoginScreen');
+      router.replace("");
     } catch (err) {
       setErrorMessages({ general: 'An unexpected error occurred. Try again.' });

[NoCoverage] BlockStatement
app/(tabs)/SignUp.tsx:159:19
 
       setErrorMessages({});
       router.replace('/LoginScreen');
-    } catch (err) {
-      setErrorMessages({ general: 'An unexpected error occurred. Try again.' });
-    } finally {
+    } catch (err) {} finally {
       setLoading(false);
     }

[NoCoverage] StringLiteral
app/(tabs)/SignUp.tsx:160:35
       setErrorMessages({});
       router.replace('/LoginScreen');
     } catch (err) {
-      setErrorMessages({ general: 'An unexpected error occurred. Try again.' });
+      setErrorMessages({ general: "" });
     } finally {
       setLoading(false);

[NoCoverage] ObjectLiteral
app/(tabs)/SignUp.tsx:160:24
       setErrorMessages({});
       router.replace('/LoginScreen');
     } catch (err) {
-      setErrorMessages({ general: 'An unexpected error occurred. Try again.' });
+      setErrorMessages({});
     } finally {
       setLoading(false);

[NoCoverage] BlockStatement
app/(tabs)/SignUp.tsx:161:15
       router.replace('/LoginScreen');
     } catch (err) {
       setErrorMessages({ general: 'An unexpected error occurred. Try again.' });
-    } finally {
-      setLoading(false);
-    }
+    } finally {}
   };
 

[NoCoverage] BooleanLiteral
app/(tabs)/SignUp.tsx:162:18
     } catch (err) {
       setErrorMessages({ general: 'An unexpected error occurred. Try again.' });
     } finally {
-      setLoading(false);
+      setLoading(true);
     }
   };

[NoCoverage] BlockStatement
app/(tabs)/SignUp.tsx:166:32
     }
   };
 
-  const validateInputs = () => {
-    let errors: { [key: string]: string } = {};
-
-    if (!fullName) errors.fullName = 'Full name is required.';
-    if (!email) errors.email = 'Email is required.';
-    if (!phoneNumber) errors.phoneNumber = 'Phone number is required.';
-    if (!password) errors.password = 'Password is required.';
-    if (!dateOfBirth) errors.dateOfBirth = 'Date of birth is required.';
-
-    const emailRegex = /\S+@\S+\.\S+/;
-    if (email && !emailRegex.test(email)) errors.email = 'Invalid email format.';
-
-    if (password.length > 0 && password.length < 8) errors.password = 'Password must be at least 8 characters.';
-    if (!(/\d/.test(password) && /[\W_]/.test(password))) errors.password = 'Password must contain at least one number and one special character';
-
-    // Validate Date of Birth (Format: MM/DD/YYYY)
-    const dobRegex = /^(0[1-9]|1[0-2])\/(0[1-9]|[12][0-9]|3[01])\/(19|20)\d\d$/;
-    if (dateOfBirth && !dobRegex.test(dateOfBirth)) errors.dateOfBirth = 'Format must be MM/DD/YYYY.';
-
-    setErrorMessages(errors);
-    return Object.keys(errors).length === 0;
-  };
+  const validateInputs = () => {};
 
   const handleSignUp = async () => {

[NoCoverage] BooleanLiteral
app/(tabs)/SignUp.tsx:169:9
   const validateInputs = () => {
     let errors: { [key: string]: string } = {};
 
-    if (!fullName) errors.fullName = 'Full name is required.';
+    if (fullName) errors.fullName = 'Full name is required.';
     if (!email) errors.email = 'Email is required.';
     if (!phoneNumber) errors.phoneNumber = 'Phone number is required.';

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:169:9
   const validateInputs = () => {
     let errors: { [key: string]: string } = {};
 
-    if (!fullName) errors.fullName = 'Full name is required.';
+    if (true) errors.fullName = 'Full name is required.';
     if (!email) errors.email = 'Email is required.';
     if (!phoneNumber) errors.phoneNumber = 'Phone number is required.';

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:170:9
     let errors: { [key: string]: string } = {};
 
     if (!fullName) errors.fullName = 'Full name is required.';
-    if (!email) errors.email = 'Email is required.';
+    if (true) errors.email = 'Email is required.';
     if (!phoneNumber) errors.phoneNumber = 'Phone number is required.';
     if (!password) errors.password = 'Password is required.';

[NoCoverage] BooleanLiteral
app/(tabs)/SignUp.tsx:170:9
     let errors: { [key: string]: string } = {};
 
     if (!fullName) errors.fullName = 'Full name is required.';
-    if (!email) errors.email = 'Email is required.';
+    if (email) errors.email = 'Email is required.';
     if (!phoneNumber) errors.phoneNumber = 'Phone number is required.';
     if (!password) errors.password = 'Password is required.';

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:171:9
 
     if (!fullName) errors.fullName = 'Full name is required.';
     if (!email) errors.email = 'Email is required.';
-    if (!phoneNumber) errors.phoneNumber = 'Phone number is required.';
+    if (false) errors.phoneNumber = 'Phone number is required.';
     if (!password) errors.password = 'Password is required.';
     if (!dateOfBirth) errors.dateOfBirth = 'Date of birth is required.';

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:171:9
 
     if (!fullName) errors.fullName = 'Full name is required.';
     if (!email) errors.email = 'Email is required.';
-    if (!phoneNumber) errors.phoneNumber = 'Phone number is required.';
+    if (true) errors.phoneNumber = 'Phone number is required.';
     if (!password) errors.password = 'Password is required.';
     if (!dateOfBirth) errors.dateOfBirth = 'Date of birth is required.';

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:172:9
     if (!fullName) errors.fullName = 'Full name is required.';
     if (!email) errors.email = 'Email is required.';
     if (!phoneNumber) errors.phoneNumber = 'Phone number is required.';
-    if (!password) errors.password = 'Password is required.';
+    if (false) errors.password = 'Password is required.';
     if (!dateOfBirth) errors.dateOfBirth = 'Date of birth is required.';
 

[NoCoverage] BooleanLiteral
app/(tabs)/SignUp.tsx:172:9
     if (!fullName) errors.fullName = 'Full name is required.';
     if (!email) errors.email = 'Email is required.';
     if (!phoneNumber) errors.phoneNumber = 'Phone number is required.';
-    if (!password) errors.password = 'Password is required.';
+    if (password) errors.password = 'Password is required.';
     if (!dateOfBirth) errors.dateOfBirth = 'Date of birth is required.';
 

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:173:9
     if (!email) errors.email = 'Email is required.';
     if (!phoneNumber) errors.phoneNumber = 'Phone number is required.';
     if (!password) errors.password = 'Password is required.';
-    if (!dateOfBirth) errors.dateOfBirth = 'Date of birth is required.';
+    if (false) errors.dateOfBirth = 'Date of birth is required.';
 
     const emailRegex = /\S+@\S+\.\S+/;

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:173:9
     if (!email) errors.email = 'Email is required.';
     if (!phoneNumber) errors.phoneNumber = 'Phone number is required.';
     if (!password) errors.password = 'Password is required.';
-    if (!dateOfBirth) errors.dateOfBirth = 'Date of birth is required.';
+    if (true) errors.dateOfBirth = 'Date of birth is required.';
 
     const emailRegex = /\S+@\S+\.\S+/;

[NoCoverage] Regex
app/(tabs)/SignUp.tsx:175:24
     if (!password) errors.password = 'Password is required.';
     if (!dateOfBirth) errors.dateOfBirth = 'Date of birth is required.';
 
-    const emailRegex = /\S+@\S+\.\S+/;
+    const emailRegex = /\S+@\S\.\S+/;
     if (email && !emailRegex.test(email)) errors.email = 'Invalid email format.';
 

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:176:9
     if (!dateOfBirth) errors.dateOfBirth = 'Date of birth is required.';
 
     const emailRegex = /\S+@\S+\.\S+/;
-    if (email && !emailRegex.test(email)) errors.email = 'Invalid email format.';
+    if (false) errors.email = 'Invalid email format.';
 
     if (password.length > 0 && password.length < 8) errors.password = 'Password must be at least 8 characters.';

[NoCoverage] BooleanLiteral
app/(tabs)/SignUp.tsx:176:18
     if (!dateOfBirth) errors.dateOfBirth = 'Date of birth is required.';
 
     const emailRegex = /\S+@\S+\.\S+/;
-    if (email && !emailRegex.test(email)) errors.email = 'Invalid email format.';
+    if (email && emailRegex.test(email)) errors.email = 'Invalid email format.';
 
     if (password.length > 0 && password.length < 8) errors.password = 'Password must be at least 8 characters.';

[NoCoverage] EqualityOperator
app/(tabs)/SignUp.tsx:178:32
     const emailRegex = /\S+@\S+\.\S+/;
     if (email && !emailRegex.test(email)) errors.email = 'Invalid email format.';
 
-    if (password.length > 0 && password.length < 8) errors.password = 'Password must be at least 8 characters.';
+    if (password.length > 0 && password.length >= 8) errors.password = 'Password must be at least 8 characters.';
     if (!(/\d/.test(password) && /[\W_]/.test(password))) errors.password = 'Password must contain at least one number and one special character';
 

[NoCoverage] EqualityOperator
app/(tabs)/SignUp.tsx:178:32
     const emailRegex = /\S+@\S+\.\S+/;
     if (email && !emailRegex.test(email)) errors.email = 'Invalid email format.';
 
-    if (password.length > 0 && password.length < 8) errors.password = 'Password must be at least 8 characters.';
+    if (password.length > 0 && password.length <= 8) errors.password = 'Password must be at least 8 characters.';
     if (!(/\d/.test(password) && /[\W_]/.test(password))) errors.password = 'Password must contain at least one number and one special character';
 

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:179:9
     if (email && !emailRegex.test(email)) errors.email = 'Invalid email format.';
 
     if (password.length > 0 && password.length < 8) errors.password = 'Password must be at least 8 characters.';
-    if (!(/\d/.test(password) && /[\W_]/.test(password))) errors.password = 'Password must contain at least one number and one special character';
+    if (false) errors.password = 'Password must contain at least one number and one special character';
 
     // Validate Date of Birth (Format: MM/DD/YYYY)

[NoCoverage] BooleanLiteral
app/(tabs)/SignUp.tsx:179:9
     if (email && !emailRegex.test(email)) errors.email = 'Invalid email format.';
 
     if (password.length > 0 && password.length < 8) errors.password = 'Password must be at least 8 characters.';
-    if (!(/\d/.test(password) && /[\W_]/.test(password))) errors.password = 'Password must contain at least one number and one special character';
+    if (/\d/.test(password) && /[\W_]/.test(password)) errors.password = 'Password must contain at least one number and one special character';
 
     // Validate Date of Birth (Format: MM/DD/YYYY)

[NoCoverage] Regex
app/(tabs)/SignUp.tsx:182:22
     if (!(/\d/.test(password) && /[\W_]/.test(password))) errors.password = 'Password must contain at least one number and one special character';
 
     // Validate Date of Birth (Format: MM/DD/YYYY)
-    const dobRegex = /^(0[1-9]|1[0-2])\/(0[1-9]|[12][0-9]|3[01])\/(19|20)\d\d$/;
+    const dobRegex = /^(0[1-9]|1[0-2])\/(0[1-9]|[^12][0-9]|3[01])\/(19|20)\d\d$/;
     if (dateOfBirth && !dobRegex.test(dateOfBirth)) errors.dateOfBirth = 'Format must be MM/DD/YYYY.';
 

[NoCoverage] Regex
app/(tabs)/SignUp.tsx:182:22
     if (!(/\d/.test(password) && /[\W_]/.test(password))) errors.password = 'Password must contain at least one number and one special character';
 
     // Validate Date of Birth (Format: MM/DD/YYYY)
-    const dobRegex = /^(0[1-9]|1[0-2])\/(0[1-9]|[12][0-9]|3[01])\/(19|20)\d\d$/;
+    const dobRegex = /(0[1-9]|1[0-2])\/(0[1-9]|[12][0-9]|3[01])\/(19|20)\d\d$/;
     if (dateOfBirth && !dobRegex.test(dateOfBirth)) errors.dateOfBirth = 'Format must be MM/DD/YYYY.';
 

[NoCoverage] BooleanLiteral
app/(tabs)/SignUp.tsx:183:24
 
     // Validate Date of Birth (Format: MM/DD/YYYY)
     const dobRegex = /^(0[1-9]|1[0-2])\/(0[1-9]|[12][0-9]|3[01])\/(19|20)\d\d$/;
-    if (dateOfBirth && !dobRegex.test(dateOfBirth)) errors.dateOfBirth = 'Format must be MM/DD/YYYY.';
+    if (dateOfBirth && dobRegex.test(dateOfBirth)) errors.dateOfBirth = 'Format must be MM/DD/YYYY.';
 
     setErrorMessages(errors);

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:183:9
 
     // Validate Date of Birth (Format: MM/DD/YYYY)
     const dobRegex = /^(0[1-9]|1[0-2])\/(0[1-9]|[12][0-9]|3[01])\/(19|20)\d\d$/;
-    if (dateOfBirth && !dobRegex.test(dateOfBirth)) errors.dateOfBirth = 'Format must be MM/DD/YYYY.';
+    if (false) errors.dateOfBirth = 'Format must be MM/DD/YYYY.';
 
     setErrorMessages(errors);

[NoCoverage] EqualityOperator
app/(tabs)/SignUp.tsx:186:12
     if (dateOfBirth && !dobRegex.test(dateOfBirth)) errors.dateOfBirth = 'Format must be MM/DD/YYYY.';
 
     setErrorMessages(errors);
-    return Object.keys(errors).length === 0;
+    return Object.keys(errors).length !== 0;
   };
 

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:186:12
     if (dateOfBirth && !dobRegex.test(dateOfBirth)) errors.dateOfBirth = 'Format must be MM/DD/YYYY.';
 
     setErrorMessages(errors);
-    return Object.keys(errors).length === 0;
+    return true;
   };
 

[NoCoverage] BlockStatement
app/(tabs)/SignUp.tsx:190:28
   };
 
   const handleSignUp = async () => {
-    if (!validateInputs()) {
-      return;
-    }
+    if (!validateInputs()) {}
 
     setLoading(true);

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:190:9
   };
 
   const handleSignUp = async () => {
-    if (!validateInputs()) {
+    if (false) {
       return;
     }

[NoCoverage] BooleanLiteral
app/(tabs)/SignUp.tsx:194:16
       return;
     }
 
-    setLoading(true);
+    setLoading(false);
 
     try {

[NoCoverage] BlockStatement
app/(tabs)/SignUp.tsx:196:9
 
     setLoading(true);
 
-    try {
-      const { data, error } = await supabase.auth.signUp({
-        email,
-        password,
-        options: {
-          data: {
-            full_name: fullName,
-            date_of_birth: dateOfBirth,
-            phone_number: phoneNumber,
-          },
-        },
-      });
-
-      if (error) {
-        setErrorMessages({ general: error.message });
-        setLoading(false);
-        return;
-      }
-
-      setErrorMessages({});
-      router.replace('/LoginScreen');
-    } catch (err) {
+    try {} catch (err) {
       setErrorMessages({ general: 'An unexpected error occurred. Try again.' });
     } finally {

[NoCoverage] ObjectLiteral
app/(tabs)/SignUp.tsx:197:58
     setLoading(true);
 
     try {
-      const { data, error } = await supabase.auth.signUp({
-        email,
-        password,
-        options: {
-          data: {
-            full_name: fullName,
-            date_of_birth: dateOfBirth,
-            phone_number: phoneNumber,
-          },
-        },
-      });
+      const { data, error } = await supabase.auth.signUp({});
 
       if (error) {

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:225:9
   };
 
   const DateOfBirthInput = () => {
-    if (Platform.OS === 'web') {
+    if (true) {
       return (
         <TextInput

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:225:9
   };
 
   const DateOfBirthInput = () => {
-    if (Platform.OS === 'web') {
+    if (false) {
       return (
         <TextInput

[NoCoverage] BlockStatement
app/(tabs)/SignUp.tsx:231:35
           style={styles.input}
           placeholder="MM/DD/YYYY"
           value={dateOfBirth}
-          onChangeText={(text) => {
-            setDateOfBirth(text);
-            setErrorMessages((prev) => ({ ...prev, dateOfBirth: '' }));
-          }}
+          onChangeText={(text) => {}}
         />
       );

[NoCoverage] ArrowFunction
app/(tabs)/SignUp.tsx:233:30
           value={dateOfBirth}
           onChangeText={(text) => {
             setDateOfBirth(text);
-            setErrorMessages((prev) => ({ ...prev, dateOfBirth: '' }));
+            setErrorMessages(() => undefined);
           }}
         />

[NoCoverage] ObjectLiteral
app/(tabs)/SignUp.tsx:233:41
           value={dateOfBirth}
           onChangeText={(text) => {
             setDateOfBirth(text);
-            setErrorMessages((prev) => ({ ...prev, dateOfBirth: '' }));
+            setErrorMessages((prev) => ({}));
           }}
         />

[NoCoverage] BlockStatement
app/(tabs)/SignUp.tsx:242:26
     return (
       <>
         <TouchableOpacity
-          onPress={() => {
-            console.log('Date picker button clicked!');
-            setShowDatePicker(true);
-          }}
+          onPress={() => {}}
         >
           <Text style={styles.input}>

[NoCoverage] StringLiteral
app/(tabs)/SignUp.tsx:243:25
       <>
         <TouchableOpacity
           onPress={() => {
-            console.log('Date picker button clicked!');
+            console.log("");
             setShowDatePicker(true);
           }}

[NoCoverage] BooleanLiteral
app/(tabs)/SignUp.tsx:244:31
         <TouchableOpacity
           onPress={() => {
             console.log('Date picker button clicked!');
-            setShowDatePicker(true);
+            setShowDatePicker(false);
           }}
         >

[NoCoverage] LogicalOperator
app/(tabs)/SignUp.tsx:248:14
           }}
         >
           <Text style={styles.input}>
-            {dateOfBirth || 'Select your date of birth'}
+            {dateOfBirth && 'Select your date of birth'}
           </Text>
         </TouchableOpacity>

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:248:14
           }}
         >
           <Text style={styles.input}>
-            {dateOfBirth || 'Select your date of birth'}
+            {true}
           </Text>
         </TouchableOpacity>
