[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:251:10
             {dateOfBirth || 'Select your date of birth'}
           </Text>
         </TouchableOpacity>
-        {showDatePicker && (
-          <DateTimePicker
-            value={new Date()}
-            mode="date"
-            display="default"
-            onChange={(event: DateTimePickerEvent, selectedDate?: Date) => {
-              console.log('Date picker closed!');
-              setShowDatePicker(false);
-              if (selectedDate) {
-                const formattedDate = selectedDate.toLocaleDateString('en-US', {
-                  month: '2-digit',
-                  day: '2-digit',
-                  year: 'numeric',
-                });
-                console.log('Selected Date:', formattedDate);
-                setDateOfBirth(formattedDate);
-                setErrorMessages((prev) => ({ ...prev, dateOfBirth: '' }));
-              }
-            }}
-          />
-        )}
+        {false}
       </>
     );

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:251:10
             {dateOfBirth || 'Select your date of birth'}
           </Text>
         </TouchableOpacity>
-        {showDatePicker && (
-          <DateTimePicker
-            value={new Date()}
-            mode="date"
-            display="default"
-            onChange={(event: DateTimePickerEvent, selectedDate?: Date) => {
-              console.log('Date picker closed!');
-              setShowDatePicker(false);
-              if (selectedDate) {
-                const formattedDate = selectedDate.toLocaleDateString('en-US', {
-                  month: '2-digit',
-                  day: '2-digit',
-                  year: 'numeric',
-                });
-                console.log('Selected Date:', formattedDate);
-                setDateOfBirth(formattedDate);
-                setErrorMessages((prev) => ({ ...prev, dateOfBirth: '' }));
-              }
-            }}
-          />
-        )}
+        {true}
       </>
     );

[NoCoverage] BlockStatement
app/(tabs)/SignUp.tsx:256:76
             value={new Date()}
             mode="date"
             display="default"
-            onChange={(event: DateTimePickerEvent, selectedDate?: Date) => {
-              console.log('Date picker closed!');
-              setShowDatePicker(false);
-              if (selectedDate) {
-                const formattedDate = selectedDate.toLocaleDateString('en-US', {
-                  month: '2-digit',
-                  day: '2-digit',
-                  year: 'numeric',
-                });
-                console.log('Selected Date:', formattedDate);
-                setDateOfBirth(formattedDate);
-                setErrorMessages((prev) => ({ ...prev, dateOfBirth: '' }));
-              }
-            }}
+            onChange={(event: DateTimePickerEvent, selectedDate?: Date) => {}}
           />
         )}

[NoCoverage] BooleanLiteral
app/(tabs)/SignUp.tsx:258:33
             display="default"
             onChange={(event: DateTimePickerEvent, selectedDate?: Date) => {
               console.log('Date picker closed!');
-              setShowDatePicker(false);
+              setShowDatePicker(true);
               if (selectedDate) {
                 const formattedDate = selectedDate.toLocaleDateString('en-US', {

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:259:19
             onChange={(event: DateTimePickerEvent, selectedDate?: Date) => {
               console.log('Date picker closed!');
               setShowDatePicker(false);
-              if (selectedDate) {
+              if (true) {
                 const formattedDate = selectedDate.toLocaleDateString('en-US', {
                   month: '2-digit',

[NoCoverage] BlockStatement
app/(tabs)/SignUp.tsx:259:33
             onChange={(event: DateTimePickerEvent, selectedDate?: Date) => {
               console.log('Date picker closed!');
               setShowDatePicker(false);
-              if (selectedDate) {
-                const formattedDate = selectedDate.toLocaleDateString('en-US', {
-                  month: '2-digit',
-                  day: '2-digit',
-                  year: 'numeric',
-                });
-                console.log('Selected Date:', formattedDate);
-                setDateOfBirth(formattedDate);
-                setErrorMessages((prev) => ({ ...prev, dateOfBirth: '' }));
-              }
+              if (selectedDate) {}
             }}
           />

[NoCoverage] StringLiteral
app/(tabs)/SignUp.tsx:260:71
               console.log('Date picker closed!');
               setShowDatePicker(false);
               if (selectedDate) {
-                const formattedDate = selectedDate.toLocaleDateString('en-US', {
+                const formattedDate = selectedDate.toLocaleDateString("", {
                   month: '2-digit',
                   day: '2-digit',

[NoCoverage] StringLiteral
app/(tabs)/SignUp.tsx:263:25
                 const formattedDate = selectedDate.toLocaleDateString('en-US', {
                   month: '2-digit',
                   day: '2-digit',
-                  year: 'numeric',
+                  year: "",
                 });
                 console.log('Selected Date:', formattedDate);

[NoCoverage] ArrowFunction
app/(tabs)/SignUp.tsx:267:34
                 });
                 console.log('Selected Date:', formattedDate);
                 setDateOfBirth(formattedDate);
-                setErrorMessages((prev) => ({ ...prev, dateOfBirth: '' }));
+                setErrorMessages(() => undefined);
               }
             }}

[NoCoverage] BlockStatement
app/(tabs)/SignUp.tsx:286:35
         <TextInput
           style={styles.input}
           value={fullName}
-          onChangeText={(text) => {
-            setFullName(text);
-            setErrorMessages((prev) => ({ ...prev, fullName: '' }));
-          }}
+          onChangeText={(text) => {}}
         />
         {errorMessages.fullName && <Text style={styles.errorText}>{errorMessages.fullName}</Text>}

[NoCoverage] ArrowFunction
app/(tabs)/SignUp.tsx:288:30
           value={fullName}
           onChangeText={(text) => {
             setFullName(text);
-            setErrorMessages((prev) => ({ ...prev, fullName: '' }));
+            setErrorMessages(() => undefined);
           }}
         />

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:291:10
             setErrorMessages((prev) => ({ ...prev, fullName: '' }));
           }}
         />
-        {errorMessages.fullName && <Text style={styles.errorText}>{errorMessages.fullName}</Text>}
+        {true}
       </View>
 

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:291:10
             setErrorMessages((prev) => ({ ...prev, fullName: '' }));
           }}
         />
-        {errorMessages.fullName && <Text style={styles.errorText}>{errorMessages.fullName}</Text>}
+        {false}
       </View>
 

[NoCoverage] BlockStatement
app/(tabs)/SignUp.tsx:300:35
           style={styles.input}
           keyboardType="email-address"
           value={email}
-          onChangeText={(text) => {
-            setEmail(text);
-            setErrorMessages((prev) => ({ ...prev, email: '' }));
-          }}
+          onChangeText={(text) => {}}
         />
         {errorMessages.email && <Text style={styles.errorText}>{errorMessages.email}</Text>}

[NoCoverage] ArrowFunction
app/(tabs)/SignUp.tsx:302:30
           value={email}
           onChangeText={(text) => {
             setEmail(text);
-            setErrorMessages((prev) => ({ ...prev, email: '' }));
+            setErrorMessages(() => undefined);
           }}
         />

[NoCoverage] ObjectLiteral
app/(tabs)/SignUp.tsx:302:41
           value={email}
           onChangeText={(text) => {
             setEmail(text);
-            setErrorMessages((prev) => ({ ...prev, email: '' }));
+            setErrorMessages((prev) => ({}));
           }}
         />

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:305:10
             setErrorMessages((prev) => ({ ...prev, email: '' }));
           }}
         />
-        {errorMessages.email && <Text style={styles.errorText}>{errorMessages.email}</Text>}
+        {false}
       </View>
 

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:305:10
             setErrorMessages((prev) => ({ ...prev, email: '' }));
           }}
         />
-        {errorMessages.email && <Text style={styles.errorText}>{errorMessages.email}</Text>}
+        {true}
       </View>
 

[NoCoverage] LogicalOperator
app/(tabs)/SignUp.tsx:311:10
       <View style={styles.inputContainer}>
         <Text style={styles.label}>Date of Birth</Text>
         <DateOfBirthInput />
-        {errorMessages.dateOfBirth && <Text style={styles.errorText}>{errorMessages.dateOfBirth}</Text>}
+        {errorMessages.dateOfBirth || <Text style={styles.errorText}>{errorMessages.dateOfBirth}</Text>}
       </View>
 

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:311:10
       <View style={styles.inputContainer}>
         <Text style={styles.label}>Date of Birth</Text>
         <DateOfBirthInput />
-        {errorMessages.dateOfBirth && <Text style={styles.errorText}>{errorMessages.dateOfBirth}</Text>}
+        {true}
       </View>
 

[NoCoverage] BlockStatement
app/(tabs)/SignUp.tsx:320:35
           style={styles.input}
           keyboardType="phone-pad"
           value={phoneNumber}
-          onChangeText={(text) => {
-            setPhoneNumber(text);
-            setErrorMessages((prev) => ({ ...prev, phoneNumber: '' }));
-          }}
+          onChangeText={(text) => {}}
         />
         {errorMessages.phoneNumber && <Text style={styles.errorText}>{errorMessages.phoneNumber}</Text>}

[NoCoverage] ArrowFunction
app/(tabs)/SignUp.tsx:322:30
           value={phoneNumber}
           onChangeText={(text) => {
             setPhoneNumber(text);
-            setErrorMessages((prev) => ({ ...prev, phoneNumber: '' }));
+            setErrorMessages(() => undefined);
           }}
         />

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:325:10
             setErrorMessages((prev) => ({ ...prev, phoneNumber: '' }));
           }}
         />
-        {errorMessages.phoneNumber && <Text style={styles.errorText}>{errorMessages.phoneNumber}</Text>}
+        {true}
       </View>
 

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:325:10
             setErrorMessages((prev) => ({ ...prev, phoneNumber: '' }));
           }}
         />
-        {errorMessages.phoneNumber && <Text style={styles.errorText}>{errorMessages.phoneNumber}</Text>}
+        {false}
       </View>
 

[NoCoverage] BlockStatement
app/(tabs)/SignUp.tsx:334:35
           style={styles.input}
           secureTextEntry
           value={password}
-          onChangeText={(text) => {
-            setPassword(text);
-            setErrorMessages((prev) => ({ ...prev, password: '' }));
-          }}
+          onChangeText={(text) => {}}
         />
         <Text style={{ fontSize: 12, color: '#666666' }}>

[NoCoverage] ArrowFunction
app/(tabs)/SignUp.tsx:336:30
           value={password}
           onChangeText={(text) => {
             setPassword(text);
-            setErrorMessages((prev) => ({ ...prev, password: '' }));
+            setErrorMessages(() => undefined);
           }}
         />

[NoCoverage] ObjectLiteral
app/(tabs)/SignUp.tsx:339:22
             setErrorMessages((prev) => ({ ...prev, password: '' }));
           }}
         />
-        <Text style={{ fontSize: 12, color: '#666666' }}>
+        <Text style={{}}>
           Password must be at least 8 characters long and include a number and special character.
         </Text>

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:342:10
         <Text style={{ fontSize: 12, color: '#666666' }}>
           Password must be at least 8 characters long and include a number and special character.
         </Text>
-        {errorMessages.password && <Text style={styles.errorText}>{errorMessages.password}</Text>}
+        {false}
       </View>
 

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:342:10
         <Text style={{ fontSize: 12, color: '#666666' }}>
           Password must be at least 8 characters long and include a number and special character.
         </Text>
-        {errorMessages.password && <Text style={styles.errorText}>{errorMessages.password}</Text>}
+        {true}
       </View>
 

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:345:8
         {errorMessages.password && <Text style={styles.errorText}>{errorMessages.password}</Text>}
       </View>
 
-      {errorMessages.general && <Text style={styles.errorText}>{errorMessages.general}</Text>}
+      {false}
 
       <TouchableOpacity style={styles.button} onPress={handleSignUp} disabled={loading}>

[NoCoverage] ConditionalExpression
app/(tabs)/SignUp.tsx:345:8
         {errorMessages.password && <Text style={styles.errorText}>{errorMessages.password}</Text>}
       </View>
 
-      {errorMessages.general && <Text style={styles.errorText}>{errorMessages.general}</Text>}
+      {true}
 
       <TouchableOpacity style={styles.button} onPress={handleSignUp} disabled={loading}>

[NoCoverage] ArrowFunction
app/(tabs)/SignUp.tsx:354:18
       {/* Google Sign-Up Button */}
       <TouchableOpacity
         style={styles.socialButton}
-        onPress={() => promptAsync()}
+        onPress={() => undefined}
         disabled={!request}
       >

[NoCoverage] BooleanLiteral
app/(tabs)/SignUp.tsx:355:19
       <TouchableOpacity
         style={styles.socialButton}
         onPress={() => promptAsync()}
-        disabled={!request}
+        disabled={request}
       >
         <Text style={styles.socialButtonText}>Sign up with Google</Text>

[NoCoverage] ArrowFunction
app/(tabs)/SignUp.tsx:363:18
       {/* Facebook Sign-Up Button */}
       <TouchableOpacity
         style={styles.socialButton}
-        onPress={() => fbPromptAsync()}
+        onPress={() => undefined}
         disabled={!fbRequest}
       >

[NoCoverage] BooleanLiteral
app/(tabs)/SignUp.tsx:364:19
       <TouchableOpacity
         style={styles.socialButton}
         onPress={() => fbPromptAsync()}
-        disabled={!fbRequest}
+        disabled={fbRequest}
       >
         <Text style={styles.socialButtonText}>Sign up with Facebook</Text>

[NoCoverage] StringLiteral
app/(tabs)/SignUp.tsx:370:34
       </TouchableOpacity>
 
       <Text style={styles.loginText}>
-        Already have an account?{' '}
+        Already have an account?{""}
         <TouchableOpacity onPress={() => router.replace('/LoginScreen')}>
           <Text style={{ fontWeight: 'bold' }}>Login</Text>

[NoCoverage] ArrowFunction
app/(tabs)/SignUp.tsx:371:36
 
       <Text style={styles.loginText}>
         Already have an account?{' '}
-        <TouchableOpacity onPress={() => router.replace('/LoginScreen')}>
+        <TouchableOpacity onPress={() => undefined}>
           <Text style={{ fontWeight: 'bold' }}>Login</Text>
         </TouchableOpacity>
