[NoCoverage] LogicalOperator
app/(tabs)/_layout.tsx:17:39
   return (
     <Tabs
       screenOptions={{
-        tabBarActiveTintColor: Colors[colorScheme ?? "light"].tint,
+        tabBarActiveTintColor: Colors[colorScheme && "light"].tint,
         headerShown: false,
         tabBarButton: HapticTab,

[NoCoverage] BooleanLiteral
app/(tabs)/_layout.tsx:18:22
     <Tabs
       screenOptions={{
         tabBarActiveTintColor: Colors[colorScheme ?? "light"].tint,
-        headerShown: false,
+        headerShown: true,
         tabBarButton: HapticTab,
         tabBarBackground: TabBarBackground,

[NoCoverage] StringLiteral
app/(tabs)/_layout.tsx:24:23
         tabBarStyle: Platform.select({
           ios: {
             // Use a transparent background on iOS to show the blur effect
-            position: "absolute",
+            position: "",
           },
           default: {},

[NoCoverage] StringLiteral
app/(tabs)/_layout.tsx:33:18
       <Tabs.Screen
         name="index"
         options={{
-          title: "Home",
+          title: "",
           tabBarIcon: ({ color }) => (
             <IconSymbol size={28} name="house.fill" color={color} />

[NoCoverage] ArrowFunction
app/(tabs)/_layout.tsx:34:23
         name="index"
         options={{
           title: "Home",
-          tabBarIcon: ({ color }) => (
-            <IconSymbol size={28} name="house.fill" color={color} />
-          ),
+          tabBarIcon: () => undefined,
         }}
       />

[NoCoverage] ArrowFunction
app/(tabs)/_layout.tsx:43:23
         name="explore"
         options={{
           title: "Explore",
-          tabBarIcon: ({ color }) => (
-            <IconSymbol size={28} name="paperplane.fill" color={color} />
-          ),
+          tabBarIcon: () => undefined,
         }}
       />

[NoCoverage] ObjectLiteral
app/(tabs)/_layout.tsx:50:18
       />
       <Tabs.Screen
         name="profile"
-        options={{
-          title: "Profile",
-          tabBarIcon: ({ color }) => (
-            <IconSymbol size={28} name="person.fill" color={color} />
-          ), // Fixed Icon
-        }}
+        options={{}}
       />
     </Tabs>

[NoCoverage] ArrowFunction
app/(tabs)/_layout.tsx:52:23
         name="profile"
         options={{
           title: "Profile",
-          tabBarIcon: ({ color }) => (
-            <IconSymbol size={28} name="person.fill" color={color} />
-          ), // Fixed Icon
+          tabBarIcon: () => undefined, // Fixed Icon
         }}
       />
