[Killed] BlockStatement
utils/sortUtils.ts:14:48
   distanceFromUser?: number; // optional for sorting by distance
 }
 
-export function sortByName(pets: Pet[]): Pet[] {
-  return [...pets].sort((a, b) => a.name.localeCompare(b.name));
-}
+export function sortByName(pets: Pet[]): Pet[] {}
 
 export function sortByDistance(pets: Pet[]): Pet[] {
killedBy: sortByName should sort names in non-decreasing order
statusReason: Error: Property failed after 1 tests
{ seed: -1457052743, path: "0:0", endOnFailure: true }
Counterexample: [[]]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
utils/sortUtils.ts:15:25
 }
 
 export function sortByName(pets: Pet[]): Pet[] {
-  return [...pets].sort((a, b) => a.name.localeCompare(b.name));
+  return [...pets].sort(() => undefined);
 }
 
killedBy: sortByName should sort names in non-decreasing order
statusReason: Error: Property failed after 1 tests
{ seed: 1284948193, path: "0:1:0:1:3:1:3:1:1:1:3:2:5:3:3:3:3:3:4:4:2:2:3:3:3:3:3", endOnFailure: true }
Counterexample: [[{"id":0,"name":" ","type":"Dog","location":{"latitude":0,"longitude":0},"photo":null,"description":"","distanceFromUser":69.56637619223018},{"id":0,"name":"","type":"Dog","location":{"latitude":0,"longitude":0},"photo":null,"description":"",

[Killed] MethodExpression
utils/sortUtils.ts:15:10
 }
 
 export function sortByName(pets: Pet[]): Pet[] {
-  return [...pets].sort((a, b) => a.name.localeCompare(b.name));
+  return [...pets];
 }
 
killedBy: sortByName should sort names in non-decreasing order
statusReason: Error: Property failed after 1 tests
{ seed: 198714463, path: "0:1:1:3:5:5:5:5:5:7:7:2:2:2:2:2:4:4:4:4:4", endOnFailure: true }
Counterexample: [[{"id":0,"name":" ","type":"Dog","location":{"latitude":0,"longitude":0},"photo":null,"description":"","distanceFromUser":69.56637619223018},{"id":0,"name":"","type":"Dog","location":{"latitude":0,"longitude":0},"photo":null,"description":"","distanceFrom

[Killed] BlockStatement
utils/sortUtils.ts:18:52
   return [...pets].sort((a, b) => a.name.localeCompare(b.name));
 }
 
-export function sortByDistance(pets: Pet[]): Pet[] {
-  return [...pets].sort((a, b) => {
-    if (a.distanceFromUser == null || b.distanceFromUser == null) return 0;
-    return a.distanceFromUser - b.distanceFromUser;
-  });
-}
+export function sortByDistance(pets: Pet[]): Pet[] {}
killedBy: sortByDistance should sort by ascending distance
statusReason: Error: Property failed after 1 tests
{ seed: -439281779, path: "0:0", endOnFailure: true }
Counterexample: [[]]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
utils/sortUtils.ts:19:10
 }
 
 export function sortByDistance(pets: Pet[]): Pet[] {
-  return [...pets].sort((a, b) => {
-    if (a.distanceFromUser == null || b.distanceFromUser == null) return 0;
-    return a.distanceFromUser - b.distanceFromUser;
-  });
+  return [...pets];
 }
killedBy: sortByDistance should sort by ascending distance
statusReason: Error: Property failed after 2 tests
{ seed: -2010854131, path: "1:1:0:0:1:1:1:9:6:2:2:1:1:3:2:1:4:1:2:6:4:2:3:2:4:1:1:1:2:1:1:2:2:2:3:3:3:3:3:3:3:3", endOnFailure: true }
Shrunk 41 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
utils/sortUtils.ts:19:35
 }
 
 export function sortByDistance(pets: Pet[]): Pet[] {
-  return [...pets].sort((a, b) => {
-    if (a.distanceFromUser == null || b.distanceFromUser == null) return 0;
-    return a.distanceFromUser - b.distanceFromUser;
-  });
+  return [...pets].sort((a, b) => {});
 }
killedBy: sortByDistance should sort by ascending distance
statusReason: Error: Property failed after 1 tests
{ seed: -929708402, path: "0:1:2:2:2:2:14:3:2:3:3:2:3:2:2:2:5:2:2:2:3:3:3:2:4:3:3:2:2:6:3:2:2:2:3:2:3:4:4:4:4:4:4:4:4", endOnFailure: true }
Shrunk 44 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
utils/sortUtils.ts:20:9
 
 export function sortByDistance(pets: Pet[]): Pet[] {
   return [...pets].sort((a, b) => {
-    if (a.distanceFromUser == null || b.distanceFromUser == null) return 0;
+    if (a.distanceFromUser != null || b.distanceFromUser == null) return 0;
     return a.distanceFromUser - b.distanceFromUser;
   });
killedBy: sortByDistance should sort by ascending distance
statusReason: Error: Property failed after 1 tests
{ seed: 151364441, path: "0:1:1:1:1:11:2:5:2:1:1:1:4:2:4:1:2:2:8:3:3:2:6:1:2:2:2:3:3:3:3:3:3:3", endOnFailure: true }
Shrunk 33 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
utils/sortUtils.ts:20:9
 
 export function sortByDistance(pets: Pet[]): Pet[] {
   return [...pets].sort((a, b) => {
-    if (a.distanceFromUser == null || b.distanceFromUser == null) return 0;
+    if (true) return 0;
     return a.distanceFromUser - b.distanceFromUser;
   });
killedBy: sortByDistance should sort by ascending distance
statusReason: Error: Property failed after 2 tests
{ seed: -1136183923, path: "1:2:1:11:2:5:2:1:1:1:4:2:4:1:2:2:8:3:3:2:5:1:3:2:2:2:3:3:3:3:3:3", endOnFailure: true }
Shrunk 31 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
utils/sortUtils.ts:21:12
 export function sortByDistance(pets: Pet[]): Pet[] {
   return [...pets].sort((a, b) => {
     if (a.distanceFromUser == null || b.distanceFromUser == null) return 0;
-    return a.distanceFromUser - b.distanceFromUser;
+    return a.distanceFromUser + b.distanceFromUser;
   });
 }
killedBy: sortByDistance should sort by ascending distance
statusReason: Error: Property failed after 2 tests
{ seed: 1552020369, path: "1:1:2:2:2:2:2:2:2:2:5:5:11:7:7:7:6:7:10:5:5:5:5:5:6:5:5:5:8:6:7:5:5:10:6:7:8:6:6:6:6", endOnFailure: true }
Shrunk 40 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
